[
  {
    "id": "bVThASvAfIM9UmUAivm1",
    "name": "What do you got on... Conscious Friendships",
    "start_date": "2024-07-31T22:45:00.000Z",
    "end_date": "2024-08-01T00:45:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/vOrhqvrOkfQn4Sa7zKfNwmE8DWk1/OdsCAf_RDLfMAfh0YvDLf?fit=clip&w=1440&auto=format",
    "organizer": "Rachel Clark",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/bVThASvAfIM9UmUAivm1",
    "summary": "As I've gotten older I've noticed that the way that I relate to others has changed, who I consider to be a friend has shifted and how complex the title  friend can be...are you my homie for life? My coworker? My community friend? All of these relationships share such a variety of intimacy and yet I've been taught to put all of these relationships under the broad title of \"friend?\"\n\nI've found that there is a lot of data out there on conscious relationships (as in romantic relationships) but not as much on conscious friendships. How has friendships shown up for you as an adult? How do you water your friendships? Have you put a lot of thought into what an adult friendship means to you now? What do we do when a friendship shifts over time and how do we do this with care? This roundtable conversation is geared towards sharing your PERSONAL stories, tools and data around Conscious Friendships with others who are also curious about this topic. \n\n\nWhy meet?\nA lot of the tools and data around conscious relating happen between myself and my newsfeed on Instagram. While Instagram is a useful tool, (thank you internet Goddex) I want to hear YOUR tools and perspectives around conscious relating and I want to share mine as well. Perhaps you feel this too?\n\nIn this roundtable conversation, you are invited to share to the level in which you are comfortable and your no is welcome in the space. Come with curiosity and a notebook and let's see what magic we can co-create!\n\n6:45 PM Doors open for arrival time\n7 PM Roundtable Conversation will starts (closed container)\n9 PM Conversation ends\n9:30 PM Open community hangout time\n\nSnacks are welcome!\n\nThis will be a donation based community event (suggested donation $5-25). Please RSVP with your donation through venmo @Rachel-Clark-100 or paypal rclarkstudio@gmail.com",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "V6BOGQQmQKec33hsjqkG",
    "name": "The Mush",
    "start_date": "2024-08-01T22:30:00.000Z",
    "end_date": "2024-08-02T02:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/8EorOP0ilkdDVOmG5VjgO2IbRQ62/f9b16c8f-e28d-45d7-97?fit=clip&w=1440&auto=format",
    "organizer": "Mihir Shah",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/V6BOGQQmQKec33hsjqkG",
    "summary": "*Please read event description in its entirety*\n\nWelcome to the Mush, a values-oriented, agreements-based, touch-positive space.\n\nA big pile of humans, celebrating a culture of Safety, Love, Authenticity and Autonomy.\n\nThe world’s first structured cuddle puddle and touch-positive consent training. The event has many aspects: philosophy, consent & communication practice, self-care extravaganza, many-handed healing touch opportunities, slow-motion contact dance, and more.\n\nOur vision is to create touch-positive communities here in NYC and around THE WORLD! We require everyone to first attend the “Welcome Mush” to get oriented around community values, agreements and all the other tools & skills we need to cuddle safely together 💛\n\nSee the Agenda for the Welcome Mush below 😊\n\n· 6:30 - 7:00 – Welcome Period (Doors Open)\n· 7:00 - 7:20 – Opening Circle (Group Sharing, What is the Mush?)\n· 7:20 - 8:00 – Sharing & Practicing Community Agreements\n· 8:00 - 8:30 – Consent & Communication Exercises\n· 8:30 - 9:00 – Creating THE MOST INCLUSIVE cuddle puddle on earth (aka the Mush, as seen above!)\n· 9:00 - 10:00 – Open Mush Time\n· 10:00 - 10:20 – Closing Circle (Group Sharing & Integration)\n\nThis is a place to open your heart and experience love and acceptance from the whole community 💖 We will revel in the beauty of touch, healthy boundaries, subtle non-verbal communication, and exploring the connection of human bodies in an explicitly non-sexual container. We also ask that everyone comes in a state of sobriety and sensitivity that supports full awareness of their own and others' boundaries.\n\nTo create a safe container for this exploration, it's only possible to join the event and receive the location if you agree to honor the Community Agreements and complete a short questionnaire. These agreements support the core values of the Mush: Safety, Love, Authenticity and Autonomy. Please review the Community Agreements and complete the questionnaire at https://forms.gle/DtujR8z4jZezjzyA8 . We’ll also be discussing and practicing the agreements during the event 😊\n\n· Doors open at 6:30 pm, Opening Circle starts at 7:00 pm, Doors close at 7:20 pm\n· Wear comfy clothing that helps you feel relaxed\n· Some snacks will be provided and you’re welcome to bring snacks to share with the group \n\nJoin us for an evening where every touch is an expression of kindness and every interaction is a step towards deeper connection. We would love to see you there 💛\n\nWe will never turn someone away due to lack of funds. If cost is an issue, work exchange in support of the event is possible. Please reach out to themushcommunity@gmail.com .\n\nAbout the Facilitator:\n\nMihir Shah first discovered the Mush on the island of Koh Phangan, Thailand. Never having heard of “cuddle parties” before 🤔, he was nervous, but curious about what the experience could be like. After that first event, he fell in love with the community, values and agreements of this touch-positive space. He loved it so much that he attended the Mush Movement Facilitator Training hosted by Mush Movement Founder Davi Rhein. Now, Mihir is committed to share the experience of the Mush in NYC. To learn more about the Mush and its origins, check out https://www.mushmovement.com/home\n\nPhoto Credits:\n\nMia Renwall\nNatural High Healing Festival 2024\nUusikaupunki Finland",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "966324541717",
    "name": "Tantric Latihan: Open Practice",
    "start_date": "2024-08-14",
    "end_date": "2024-08-14",
    "start_time": "19:00",
    "end_time": "21:00",
    "timezone": "America/New_York",
    "location": "128 Jefferson Avenue, Brooklyn, NY 11216",
    "price": "33.85 USD",
    "imageUrl": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F817186019%2F188256597734%2F1%2Foriginal.20240630-215024?w=512&auto=format%2Ccompress&q=75&sharp=10&rect=10%2C0%2C2160%2C1080&s=13b6c066340bcd47d0b98aa6ea7e2965",
    "organizer": "Youtopia DreamSpace",
    "organizerUrl": "https://www.eventbrite.com/o/youtopia-dreamspace-17500282424",
    "eventUrl": "https://www.eventbrite.com/e/tantric-latihan-open-practice-tickets-966324541717",
    "summary": "The essence of the Latihan is to allow and follow the spontaneous inner movements from within. It is different and unique for each person",
    "tags": [
      "Other",
      "Community & Culture",
      "Class, Training, or Workshop",
      "dance",
      "tantra",
      "workshop",
      "sensuality",
      "consciousness",
      "somatic",
      "somaticmovement",
      "spiritual_growth",
      "spiritual_awakening",
      "love_and_relationships"
    ],
    "min_ticket_price": "33.85 USD",
    "max_ticket_price": "108.55 USD",
    "source": "Eventbrite"
  },
  {
    "id": "937986150827",
    "name": "Liquid Love - NYC",
    "start_date": "2024-08-17",
    "end_date": "2024-08-17",
    "start_time": "15:00",
    "end_time": "19:30",
    "timezone": "America/New_York",
    "location": "128 Jefferson Avenue (Please Check Your Confirmation Email for Details), Brooklyn, NY 11216",
    "price": "55.20 USD",
    "imageUrl": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F783742529%2F188256597734%2F1%2Foriginal.20240605-174545?w=405&auto=format%2Ccompress&q=75&sharp=10&s=998ac95e657fa9959059217fb3d3daaf",
    "organizer": "Youtopia DreamSpace",
    "organizerUrl": "https://www.eventbrite.com/o/youtopia-dreamspace-17500282424",
    "eventUrl": "https://www.eventbrite.com/e/liquid-love-nyc-tickets-937986150827",
    "summary": "Liquid Love is a Collective Journey of the Senses.",
    "tags": [
      "Other",
      "Other",
      "tantra",
      "workshop",
      "connection",
      "mindfulness",
      "intimacy",
      "sensuality",
      "consciousness",
      "somatic",
      "touch",
      "consciouscommunity"
    ],
    "min_ticket_price": "55.20 USD",
    "max_ticket_price": "135.23 USD",
    "source": "Eventbrite"
  },
  {
    "id": "937970804927",
    "name": "DreamSpace  Cuddles & Connection",
    "start_date": "2024-08-28",
    "end_date": "2024-08-28",
    "start_time": "18:30",
    "end_time": "22:30",
    "timezone": "America/New_York",
    "location": "128 Jefferson Avenue, Brooklyn, NY 11216",
    "price": "33.85 USD",
    "imageUrl": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F800544669%2F188256597734%2F1%2Foriginal.20240702-203619?w=405&auto=format%2Ccompress&q=75&sharp=10&s=2e6d696236a5695cc3259ee72f221be5",
    "organizer": "Youtopia DreamSpace",
    "organizerUrl": "https://www.eventbrite.com/o/youtopia-dreamspace-17500282424",
    "eventUrl": "https://www.eventbrite.com/e/dreamspace-cuddles-connection-tickets-937970804927",
    "summary": "DreamSpace Cuddles & Connection",
    "tags": [
      "Other",
      "Other",
      "wellness",
      "workshop",
      "awareness",
      "connection",
      "somatic",
      "boundaries",
      "consent",
      "cuddle",
      "consciouscommunity"
    ],
    "min_ticket_price": "33.85 USD",
    "max_ticket_price": "108.55 USD",
    "source": "Eventbrite"
  },
  {
    "id": "uZYfUgLP2qao4JznpqUK",
    "name": "Two Circles: Men's + Women's Work Together At Last",
    "start_date": "2024-08-02T22:30:00.000Z",
    "end_date": "2024-08-03T03:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$30",
    "imageUrl": "https://partiful.imgix.net/user/oBnYZbgbcAY4wDZw1eNpJzC3EAi2/wG1QcpLXlveOgn7x1OX88?fit=clip&w=1440&auto=format",
    "organizer": "NC",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/uZYfUgLP2qao4JznpqUK",
    "summary": "Men and women separately are both doing the work. Now, it’s time to come together, unite our efforts, and help each other grow into our divine selves for more intentional, healing, and nourishing relationships.\n\nJoin us for an evening of intimate connection, soul-stirring discussions, experiential exercises, and deep rituals designed to bring out the best in all of us as we learn from and support each other. \n\nIn this event, we will:\n•⁠  ⁠Share our experiences as men for women to learn and benefit from a better understanding of men 's perspectives.\n•⁠  ⁠Share our experiences as women for men to learn and benefit from a better understanding of women's perspectives.\n•⁠  ⁠Co-create a nourishing environment for group healing and transformation.\n•⁠  ⁠Explore the \"technology\" of masculine + feminine dynamics.\n•⁠  ⁠Practice intuition and devotion as acts of sacred service.\n•⁠  ⁠Honor the masculine and cherish the feminine.\n•⁠  ⁠Celebrate and honor our differences.\n•⁠  ⁠Foster potent connections between familiar faces and strangers alike.\n•⁠  ⁠Approach curiosity and desire with integrity.\n•⁠  ⁠Learn practical tools to enhance our relationships and dating lives.\n\nIMPORTANT INFORMATION:\nArrival: Please arrive between 6:30-6:45 PM. Doors close at 6:55 PM, as we will start promptly at 7 PM.\nNon-smoking & Shoes-free space: Please respect this.\nToilets: Available upon arrival or mid-session (around 9 PM).\nPhones: Please switch off your phone upon arrival.\nFees: Pay in advance to avoid delays. Venmo @mikaal-bates ($30). If you don’t have Venmo, please bring the exact amount in cash.\nDress code: Dress to present your best self while ensuring you are comfortable.\nDinner: We recommend having dinner beforehand. Non-alcoholic beverages and snacks will be served after the session. Participants are welcome to stay and socialize for a while after we close the circle. The event will conclude at 11 PM.\n\nDirections to One Button:\nEnter the main entrance (see picture below) and use the elevator on the right, between the front door and the reception desk.\nGo to the 5th floor, turn right, then left (pass in front of the women’s and men’s bathrooms).\nFollow the corridor on the left. One Button is room #527 on the right side. Look for the logo (see picture below) on the wall to identify the entrance.\n\n\n----\nAbout the co-facilitators:\n\nMikaal Bates:  \nMikaal is a dedicated practitioner whose mission is two-fold: \n1) Ignite, accelerate, & celebrate the conscious evolution of men & healthy masculinity across the planet; \n2) Heal the divide between men and women by teaching the lost arts of ‘Sacred Union.’ \n\n Mikaal's work is a blend of embodied masculine leadership, dialogic coaching methodologies, ritual theater, rites of passage, and various traditions of initiation and spiritual union. He offers professional coaching services & facilitates Men’s Work and “Sacred Union” workshops, \"ReMasculation Podcast Host, Psychedelic Integration Guide, keynote speaker, and Leadership Consultant.https://www.mikaalbates.com/\n\nElodie Perrat \nElodie is a sustainable development expert with over 15 years of international affairs experience. Believing that true sustainability starts within ourselves and our communities, she creates transformative spaces for personal and collective growth. Initially founding a women's circle, her curiosity about men's experiences led her to explore mutual support in healing and transforming interactions. She aims to address deep-seated conditioning and toxic patterns, fostering supportive and nurturing relationships. A student of Pachamama and ISTA, Elodie has led numerous circles, assisted in plant medicine ceremonies, and shares transformative tools to enhance interpersonal interactions.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "sdgNsPuvn6xjKlPewYKi",
    "name": "New Moon Red Tent",
    "start_date": "2024-08-06T23:00:00.000Z",
    "end_date": "2024-08-07T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$10",
    "imageUrl": "https://partiful.imgix.net/user/Z83aKUEFXffWADDkLTZOidNwjXT2/DaPbNE0yItVq9dLJRwZ8m?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/sdgNsPuvn6xjKlPewYKi",
    "summary": "Our next New Moon Red Tent Women’s Circle is Tuesday Aug 6th at 7-9pm. It will be an evening of cocreation to share, witness, and melt. This will be our 8th one here in NY! 🌑✨ So special to be hosted by Rachel at Youtopia DreamSpace in Bedstuy.\n\n*What is a Red Tent?*\nThe Red Tent global movement creates spaces intentionally co-created for women to share, connect and authentically be. Red Tents are spaces for women to share their stories, rest and gain strength from being together and supporting one another.\n\nThese spaces can take many forms but essentially they are:\n🌹 women meeting and holding a circle where each\n🌹 woman gets time and space to speak without discussion or debate;\n🌹 women meeting regularly at an agreed time and place;\n🌹 gatherings which are either free or donation-based to cover room hire or tea\n🌹 circles which respond to the wishes of those present rather than primarily running workshops, trainings or any deliberate kind of personal development.*\n\n*description from https://redtentdirectory.com/\n\nIt’s time to build a community here in NY for a donation based safe, nourishing space for monthly gatherings and ongoing networking and support. I’ve been learning from women around the world of how they hold and host these spaces and so glad to be sharing here. If anyone is interested in getting more involved in cocreating as it grows please reach out as well.\n\nSuggested donation $10 to confirm your spot but you are fully welcome, if this is a hardship please do still come xx\n\nHope to see you :)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "6IvqF8slRXd1i5DM56eW",
    "name": "Did you eat yet?  AAPI  Potluck",
    "start_date": "2024-08-11T21:00:00.000Z",
    "end_date": "2024-08-11T23:00:00.000Z",
    "location": "Get on the list to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/8a9tx0p8bhdeTvfBTh8lOlDSABW2/cca01624-08b1-46eb-a0?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/6IvqF8slRXd1i5DM56eW",
    "summary": "Join us for an intentional AAPI Potluck with meditation, live music, and connection.\n\nWe’re curating a space for pan-Asian (AAPI) entrepreneurs, creatives, professionals, and allies to connect over wellbeing and culture. We’d love for you to join and contribute🫶\n\nThis is a co-created effort, so please bring a dish, snack, or drink that reminds you of home—whatever that means to you. \n\n👉Please comment below so we can make sure we have a balanced spread :) \n\nWhat to expect:\n- Guided meditation with accompanying sounds performed live w/ Alfred\n- Intentional convo prompts facilitated by Jenn  \n- Let’s eat! Family style potluck 🥟🍛🥢\n\nBackstory: what started as a small gathering of pan Asians at a festival has blossomed into an intimate community for entrepreneurs, creatives and founders to connect over culture, community and wellbeing. \n\nLocation:\nWe’ll be on the rooftop of McKibbin Lofts, i’m a community hub of innovation.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "D0qnGY5DCrDUk08JUIfk",
    "name": "Monday Circling",
    "start_date": "2024-06-17T23:30:00.000Z",
    "end_date": "2024-06-18T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "Vincenzo Minino",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/D0qnGY5DCrDUk08JUIfk",
    "summary": "Join Jeff Muller for a circling evening!!\nI am excited Jeff is able to step in this Monday to lead circling, I unfortunately won’t be able to be there. \n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope you’ll be there to continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator-\nJeff loves to relate vulnerably with others. So he found a home in circling. He has been certified to lead circles by the Circling Europe organization. When not circling, Jeff has family and friends he loves & he is a psychotherapist by trade.\n\nDoors will open at 7:30 and the container opens at 7:45pm. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "9IuNVlykrOnFdxQu8J6v",
    "name": "AR Community Night",
    "start_date": "2024-08-14T22:45:00.000Z",
    "end_date": "2024-08-15T00:45:00.000Z",
    "location": "RSVP to see location",
    "price": "$30",
    "imageUrl": "https://media4.giphy.com/media/wfHUSBTTrH1PIL2zgZ/giphy.webp?cid=c00e53c6ibes6bbzh6nvhhaxuo3za5l58ww2sdq393z59rof&ep=v1_gifs_search&rid=giphy.webp&ct=g",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/9IuNVlykrOnFdxQu8J6v",
    "summary": "Welcome to the bi-monthly Authentic Relating community night. ✨\n\nEnjoy an evening of slowing down, stepping into presence, and enjoying intentional connection with yourself and others through playing simple - yet potent - Authentic Relating games. \n\nThe theme for Aug 14th is \"intuition and reflection\" and will be cofacilitated by Karam and Steph ✨\n\nWe’ll provide a few light snacks and tea, but feel free to bring your favorite snack to share! 🍪☕️\n_﻿_____________________________\n\nOverview\n• 𝐖𝐡𝐨: Karam & Steph with guest facilitators trained in Authentic Relating & Circling.\n• 𝐖𝐡𝐚𝐭: Authentic Relating Games + Open Circle (~50% each)\n• 𝐖𝐡𝐞𝐧: Every other Wednesday night from 6:45 pm-9:30pm in 2024. Our upcoming dates are: Aug 14th. Doors open 15 minutes before the event start time. \n• 𝐖𝐡𝐞𝐫𝐞: Aug 14th event will be held in a private residence in Battery Park. Other events are either at Alchemical Studios in Flatiron, or at a fellow circler's residence in Battery Park. All spaces have elevator access. \n• 𝐖𝐡𝐲: Our vision is to create a more consistent community container grounded in Authentic Relating practices. We want to create a space where people can slow down in a busy city, practice present-moment connection with self and other, and integrate this type of relating into our daily lives with more regular practice. Over time, we hope to create an Authentic Relating support system in NYC.\n_﻿_____________________________\n\nAgenda\nWhat you can expect during a community night:\n• Connect to self & group check-in | 20 min\n• Themed AR games (usually in dyads) | 60 min\n• Break | 10 min\n• Group games, Open circles and/or Birthday circles | 60 min\n\nThe agenda may evolve as needed. We may also introduce themed practice nights or sessions that incorporate another modality (e.g. embodied movement), but these will be communicated ahead of time.\n_﻿_____________________________\n\n𝐏𝐫𝐢𝐜𝐢𝐧𝐠 (Donation):\n*Limited Spots Available*\n• Suggested Donation: $30\nWe hold a value for the accessibility of these practices, so no one will ever be turned away for lack of funds. If you’re curious about Authentic Relating, you are invited to pay only what you’re able to/what feels supportive for you to co-create this practice container.\n_﻿_____________________________\n\n𝐃𝐢𝐬𝐜𝐥𝐚𝐢𝐦𝐞𝐫:\n* Some experience with Authentic Relating or Circling is necessary, as we will not be reviewing/teaching all practices at every meeting.\n_﻿_____________________________\n\n𝐌𝐞𝐞𝐭 𝐘𝐨𝐮𝐫 𝐅𝐚𝐜𝐢𝐥𝐢𝐭𝐚𝐭𝐨𝐫𝐬:\n| Karam |\nKaram (he/him) believes in the power of connection as medicine. That we are all gifts, and that we hold gifts for others. That when we deepen our present moment connection to ourselves and to others, we create more space for what is here, and that this space can sometimes brings about profound healing.\n\nHe has been Authentic Relating since 2019. He graduated from ART Levels 1-3 and ALP, and is currently working on his ART facilitator certification.\n\n| Steph |\nSteph (she/they) believes in the transformational power of self-inquiry and group witnessing. Steph’s facilitation is rooted in their background in interpersonal dynamics-informed leadership and Diversity, Equity and Inclusion work. At their core, Steph is about self and collective liberation.\n\nSteph is a graduate of ART’s Levels 1, 3, and ALP. They currently co-host the BIPOC community circle on ARTLand and are working on their ART facilitator certification.\n\n| Racheli |\nRacheli (she/her) is a New York-based facilitator devoted to human connection and wholeness through transformative relating. She specializes in fostering spaces for embracing vulnerability, self-acceptance, and emotional intelligence, allowing people to unite with their fullness.\n\nShe has been training with ART International since 2021, and recently finished her certification. Her exploration of AR has led her to developing conscious communication programs for youth overseas, facilitating team bonding workshops, and holding weekly spaces for adults in NYC since 2022.\n\n| Charlie |\nCharlie Burlingham is a trauma-informed group facilitator, meditation guide, and neuroscientist. He holds a PhD in Experimental Psychology and teaches at NYU and Bard Microcollege. His scientific research explores the intricate links between perception and autonomic nervous system. After training for 3 years with the Radical Honesty Institute and facilitating various types of groups, he has arrived at his own style — emphasizing consent, deep listening, and somatic awareness. You can find him enjoying dance and movements jams around the city. https://charlieburlingham.com/\n\nWhy Us?\nWe are all enrolled in Authentic Relating facilitator training and have a desire to bring this practice into the NYC ecosystem to co-create the community we want for ourselves.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "CbcTts4QedQ5BCQEFlS7",
    "name": "The Connection Series",
    "start_date": "2024-07-09T22:45:00.000Z",
    "end_date": "2024-07-10T01:30:00.000Z",
    "location": "Sign in to see location",
    "price": "$50",
    "imageUrl": "https://partiful.imgix.net/user/1OlBWVNVqyMoz8SJxauMNCeobSV2/b49e2de9-fb58-4b47-a1?fit=clip&w=1440&auto=format",
    "organizer": "Racheli Yardeni",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/CbcTts4QedQ5BCQEFlS7",
    "summary": "Introducing:✨The Connection Series✨\n\nA series of Authentic Relating workshops facilitated by Racheli Yardeni, designed to empower you with tools to bring more connection, intimacy, fulfillment, and joy, into all of your relationships. \n\nThe workshops will be held throughout the summer and each have a combination of Authentic Relating theory, exercises and games, light movement, and open-group discussions; allowing you to learn and practice through play. \n\n✨✨✨✨✨✨✨✨✨✨✨✨✨✨\n\nThis workshops theme is how to create shared realities in your relationships. \n\nA shared reality is when you have a deep understanding of another’s experience. It is when your reality and another persons overlap, and you feel deeply seen, known, understood, and connected to one another. 🫀\n\nWhen we hide ourselves, create stories and assumptions without checking them, or hold onto fixed points of views, we can miss the beauty of connection available for us, many times resulting in conflict, and feelings of loneliness. \n\nHere comes in shared realities: to create less loneliness and separation, and more connection. 💘\n\nThis session will give you the opportunity to:  \n✨Slow down, come into presence, and relate authentically to yourself and new people in a facilitated container \n✨Learn, practice, and take home, simple - yet potent - Authentic Relating tools to bridge gaps of separation in your relationships and feel more understood and connected. \n✨ Practice stepping into vulnerability, expressing yourself, and being seen by others. \n✨Explore relational patterns and stories you hold that are creating your relationships, with a curious and nonjudgmental lens. \n✨PLAY - and feel the nourishment of connection.\n\nCome as you are, all of you is welcome. 🤍\n\nTIME ⏰  \nDoors open: 6:45pm\nOpening circle: 7:00pm-7:15pm \nAR Games and circling: 7:15pm- 9:15pm \nClosing circle: 9:15pm-9:30pm \nEvent ends: 9:30pm \n*Please arrive before 7:00pm to give yourself time to settle in and arrive before the opening circle, it is important to open this container with everyone present. 🙏🏻 \n\n🍒 Fruits and other nourishing goodies will be provided. \n\nADDRESS 🏡 \nRandy Warshaw Studio\n115 Wooster Street, 2F\nSoho, New York \n\nCOST 💸  \n$50\nTo save your spot RSVP here and Venmo @RacheliYardeni. \n~ There are three $30 discounted seats available - message Racheli at 646-734-0933 to claim them. 🌹\n\nCancellation policy: there are no refunds, only credit given. If you cancel up to 24 hours before, you get full credit for the workshop of your choice, if you cancel in the same day, you receive 50% credit. \n\nABOUT ❤️‍🔥\nRacheli is a New York-based facilitator dedicated to human connectivity and wholeness through the art of transformative relating.\n\nHer workshops embrace vulnerability, self-acceptance and emotional intelligence - creating sanctuaries for people to unite with their fullness. \n\nRacheli is a certified facilitator with ART International; the leading Authentic Relating organization in the world. Her exploration of this work has brought her to developing conscious communication programs for youth oversees, facilitating team bonding workshops, and holding weekly spaces for adults in NYC since 2022.\n\n-----------------------------------------------\nA note from R:\n\nThese events are a space to slow down, be, explore, and welcome what this gift of being human is all about. It is a space to remind you that you are not alone & that you are worthy of being seen, loved, and known in all that you are. 🫀✨\n\nAll are welcome, I hope to see you there 🫶🏻\n- Racheli",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "0NCzB6SMIshrAhdJpgSf",
    "name": "Monday Circling",
    "start_date": "2024-06-24T23:30:00.000Z",
    "end_date": "2024-06-25T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "Vincenzo Minino",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/0NCzB6SMIshrAhdJpgSf",
    "summary": "Join me for a circling evening!!\nI am excited to continue a weekly circling event.\n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope to see you there and continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator -\nWith a masters in science from his native city of Naples, Italy, Vincenzo came to New York City 25 years ago to pursue his current career as quality compliance director for a multinational company. Resolving conflicts between offices around the globe, he brings a unique understanding of what it takes to get another's world. He's currently attending the 4th year of training to become a licensed psychoanalyst at Gestalt Associates for Psychotherapy. He sought out Circling originally to strengthen his connection with his young daughter. Circling enriched this relationship and others through his years of weekly practice, retreats, and applying the tools daily in his relationship with Alison. He also trained with Harville Hendrix Ph.D. and Helen LaKelly Hunt Ph.D., authors of \"Getting the Love You Want\" and creators of Imago therapy. Vincenzo is committed to teaching his practice for personal and professional conflict resolution. He's especially interested in supporting men to reconcile society's rigid definition of masculinity and vulnerability in his weekly men's group.\nFor more information on Vincenzo and his offerings please visit https://www.vincenzominino.com/\n\nDoors will open at 7:30. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "72OFtghpdj8wNHpatGY8",
    "name": "Relating Games Night, Hoboken",
    "start_date": "2024-06-26T23:00:00.000Z",
    "end_date": "2024-06-27T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$15",
    "imageUrl": "https://partiful.imgix.net/user/2OXLD1dC9gT8BhJ9eFGxHiPtbjl1/hYdm8MT5iWcU7WJPBh-Rf?fit=clip&w=1440&auto=format",
    "organizer": "Pete Benedict",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/72OFtghpdj8wNHpatGY8",
    "summary": "THIS WEEK'S THEME: \"Stories in the Moment.\" Curious?\n\nDrawing from communication practices of the relational arts (what's that, you ask? see links below), participants take part in games and exercises to develop greater emotional intelligence and capacity to be more present in the moment to interpersonal dynamics. Relating games can enable participants to form deeper, more authentic connections with others, increase spontaneity and flow in interpersonal interactions, and feel a greater sense of community and belonging. This weekly group involves sitting and sharing verbally *and* also experiential games and exercises, including bodily movement and action, with some verbal introduction or orient participants. The relational arts include practices such as Authentic Relating, Circling, Council Practice, Nonviolent Communication, and other communication practices.\nHere are some links with further info:\nWhat is Authentic Relating? https://www.authrev.org/what-is-authentic-relating\nWhat is Circling? https://www.youtube.com/watch?v=JYObPaUtfH4 \nBenefits of Circling: https://www.circlingeurope.com/benefits-of-circling\n\n(This is an open community event with Venmo link directly to the bookstore for *Suggested Donation of $15. Limited spots available.)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "MZ5FF9OLqCRTtDvAbpAv",
    "name": "Circle",
    "start_date": "2024-06-30T18:00:00.000Z",
    "end_date": "2024-06-30T21:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://images.unsplash.com/photo-1606318621597-c057f7d4926e?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxOTg2Nzh8MHwxfHNlYXJjaHwxfHxtb3VudGFpbnxlbnwwfDJ8fHwxNzA2MzE1ODcxfDA&ixlib=rb-4.0.3&q=80&w=400",
    "organizer": "RKM",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/MZ5FF9OLqCRTtDvAbpAv",
    "summary": "Join us for an exploration of self and other.\n\n\nThrough dropped-in connection and truthful expression.\n\n\nThrough potent, held relational and embodiment practices. \n\n\nThis is a container, ritual, and practice ground for showing up, embodied and in relationship, and in the here-and-now.\n\n\nIn our carefully designed structure inspired by Circling, Contact Improvisation, Authentic Movement, Authentic Relating, and other relational/social meditation and body-based practices…\n\n\nWe'll set aside our social constructs and conventions to connect - first in dyads then in circle as a group - to reveal ourselves more fully, both to ourselves and our community, truthfully and from the heart.\n\n\nIt’s an emergent group space opened through presence, embodied listening, and authentic expression.\n\n\nWe practice tracking and being with ourselves while being together in non-reactive, emergent, spontaneous, authentic, non-fixing, and grounded ways.\n\n\nAs we lean into naming what is and showing up fully, we experience the medicine of bringing truth to one another and the relief and beauty of being real together.\n\n\n…Of being together as we truly are, discovering together what will become of our amplified togetherness.\n\n\nFeel the nourishing and insight-bearing effects of attuned connection.\n\n\nInterrupt patterns and tendencies that lead to enmeshment, codependency, and projection.\n\n\nLearn more about relation and group dynamics, and the surprising aspects of embodied, emotional, energetic experience.\n\n\nPractice staying grounded in moments of intensity.\n\n\nExperience genuine connection and authentic ways of being with people.\n\n\nThis space can be deeply moving and impactful, restoring to our relational fields, and provide imprints towards wholeness, connection, and self-awareness. And is fun, healing, and unusually alive. You are welcome. \n\n\nHosted by Rob Kancler and Michael Fleit, who each come with many years of dedicated investigation of embodiment and self.\n\n\nSuggested Donation: $20-50, RVSP and completed Venmo @Robert-Kancler needed to register.\n\nPS - Arrival/soft start 1:30p, door close and we’ll begin at 2:00.\n\nPPS - Here's some info about the container, to give you a better sense of what this is and how it's held:\n\nSeven Agreements -  These are firm. If you agree with them, welcome to the space.\n1 - Confidentiality. \n2- Honor yourself. Trust your knowing of your limits. Take responsibility for yourself and your needs.\nThere is a STOP lever on the train.\n3 - Honor others. Be kind and respectful.\n4 - Don’t try to save or fix. Don’t give advice. Don’t assume someone is asking for help because they share, or need anything because they are visibly emotional.\n5 - Practice Responsibility. Own your experience 100% and allow others to do the same. Speak from the “I”. Own your assumptions. Own your stories.\n6 - No gossip. Don’t speak disparagingly about anyone who is not present. Don’t reveal personal information about anyone who is not present.\n7 - We agree to stay until the end.\n\n\nSeven Suggestions - Invitations for our time together.\n1 - Be all in. Play full out. Your full participation will serve the most rich experience for yourself and the collective.\n2 - Attunement. Practice deep listening. Sense in whether who may be one to carry the collective unfolding in each moment and the next. Beware of hijacking. Try to track where the most energy is rather than whats the latest or the loudest. \n3 - Authenticity. Reveal, don’t conceal. Don’t withhold authentic expression to manage your reputation, the feelings of others, or to be “nice” or “polite”.\n4 - Play outside of your regular comfort zone. The discomfort of vulnerability and venturing into the unknown is often just before the good stuff.\n5 - Be curious. Approach things with an open mind and heart. Seek to see the humanity in others. Understand where you do not is more likely a reflection of yourself than anything about them.\n6 - We’re in this together. This is an interconnected collective experience which extends beyond being a separate individual. Be fully present when others are sharing or getting support. They are you and may be an “asset” and exactly what you’d most benefit from being present with.\n7 - Enjoy. Play. Have fun.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "tRwgYj0r3WCWc01SxaAx",
    "name": "Monday Circling",
    "start_date": "2024-07-01T23:30:00.000Z",
    "end_date": "2024-07-02T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "JM",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/tRwgYj0r3WCWc01SxaAx",
    "summary": "Join Jeff Muller for a circling evening!!\nI am excited Jeff is able to step in this Monday to lead circling, I unfortunately won’t be able to be there. \n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope you’ll be there to continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator-\nJeff loves to relate vulnerably with others. So he found a home in circling. He has been certified to lead circles by the Circling Europe organization. When not circling, Jeff has family and friends he loves & he is a psychotherapist by trade.\n\nDoors will open at 7:30 and the container opens at 7:45pm. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "C6AZAF9wK5ZbraJf0UHA",
    "name": "Relating Games Night, Hoboken",
    "start_date": "2024-07-03T23:00:00.000Z",
    "end_date": "2024-07-04T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$15",
    "imageUrl": "https://partiful.imgix.net/user/2OXLD1dC9gT8BhJ9eFGxHiPtbjl1/hYdm8MT5iWcU7WJPBh-Rf?fit=clip&w=1440&auto=format",
    "organizer": "Pete Benedict",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/C6AZAF9wK5ZbraJf0UHA",
    "summary": "This Week's THEME: The Changing Now\n\nDrawing from communication practices of the relational arts (what's that, you ask? see links below), participants take part in games and exercises to develop greater emotional intelligence and capacity to be more present in the moment to interpersonal dynamics. Relating games can enable participants to form deeper, more authentic connections with others, increase spontaneity and flow in interpersonal interactions, and feel a greater sense of community and belonging. This weekly group involves sitting and sharing verbally *and* also experiential games and exercises, including bodily movement and action, with some verbal introduction or orient participants. The relational arts include practices such as Authentic Relating, Circling, Council Practice, Nonviolent Communication, and other communication practices.\nHere are some links with further info:\nWhat is Authentic Relating? https://www.authrev.org/what-is-authentic-relating\nWhat is Circling? https://www.youtube.com/watch?v=JYObPaUtfH4 \nBenefits of Circling: https://www.circlingeurope.com/benefits-of-circling\n\n(This is an open community event with Venmo link directly to the bookstore for *Suggested Donation of $15. Limited spots available.)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "zHxtXQa75sHjhp5GKlkR",
    "name": "Monday Circling",
    "start_date": "2024-07-08T23:30:00.000Z",
    "end_date": "2024-07-09T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "JM",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/zHxtXQa75sHjhp5GKlkR",
    "summary": "Join Jeff Muller for a circling evening!!\nI am excited Jeff is able to step in this Monday to lead circling, I unfortunately won’t be able to be there. \n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope you’ll be there to continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator-\nJeff loves to relate vulnerably with others. So he found a home in circling. He has been certified to lead circles by the Circling Europe organization. When not circling, Jeff has family and friends he loves & he is a psychotherapist by trade.\n\nDoors will open at 7:30 and the container opens at 7:45pm. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "kJ7B1sSvsN7ywPHGftOi",
    "name": "Relating Games Night, Hoboken",
    "start_date": "2024-07-10T23:00:00.000Z",
    "end_date": "2024-07-11T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$15",
    "imageUrl": "https://partiful.imgix.net/user/2OXLD1dC9gT8BhJ9eFGxHiPtbjl1/hYdm8MT5iWcU7WJPBh-Rf?fit=clip&w=1440&auto=format",
    "organizer": "Pete Benedict",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/kJ7B1sSvsN7ywPHGftOi",
    "summary": "This Week's THEME: \"Nonverbal Vibes\"\n\nDrawing from communication practices of the relational arts (what's that, you ask? see links below), participants take part in games and exercises to develop greater emotional intelligence and capacity to be more present in the moment to interpersonal dynamics. Relating games can enable participants to form deeper, more authentic connections with others, increase spontaneity and flow in interpersonal interactions, and feel a greater sense of community and belonging. This weekly group involves sitting and sharing verbally *and* also experiential games and exercises, including bodily movement and action, with some verbal introduction to orient participants. The relational arts include practices such as Authentic Relating, Circling, Council Practice, Nonviolent Communication, and other communication practices.\nHere are some links with further info:\nWhat is Authentic Relating? https://www.authrev.org/what-is-authentic-relating\nWhat is Circling? https://www.youtube.com/watch?v=JYObPaUtfH4 \nBenefits of Circling: https://www.circlingeurope.com/benefits-of-circling\n\n(This is an open community event with Venmo link directly to the bookstore for *Suggested Donation of $15. Limited spots available.)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "LT5iWiVIoZOfzkwuLPzz",
    "name": "Circle-ish",
    "start_date": "2024-07-11T21:30:00.000Z",
    "end_date": "2024-07-12T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/aLJEX0QBIDTVyG4XuBZkBh0cwvh2/wg0mYOslidjIpBqBaBY9a?fit=clip&w=1440&auto=format",
    "organizer": "MRK",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/LT5iWiVIoZOfzkwuLPzz",
    "summary": "We are gathering again for relational presence practice.\n\nThrough embodiment and relational-skills practices as well as sitting in an open circle we will practice tracking our present-moment experience relationally.\n\nThe space is a container, ritual and practice group for being grounded and relational drawing on practices  like Contact Improvisation, Authentic Movement, Circling, Authentic Relating and meditation.\n\nWe practice tracking and being with ourselves while being together in non-reactive, emergent, spontaneous, authentic, non-fixing, and grounded ways.\n\nAs we lean into naming what is and showing up fully, we experience the medicine of bringing truth to one another and the relief and beauty of being real together.\n\n\nWe'll:\n\nFeel the nourishing and insight-bearing effects of attuned connection.\n\nInterrupt patterns and tendencies that lead to enmeshment, codependency, and projection.\n\nLearn more about relation and group dynamics, and the surprising aspects of embodied, emotional, energetic experience.\n\nPractice staying grounded in moments of intensity.\n\nBenefit from the permission to show up more fully.\n\nExperience genuine connection and authentic ways of being with people.\n\n***\n\nHosted by Rob Kancler and Michael Fleit, who each come with many years of dedicated investigation of embodiment and self.\n\n\nSuggested Donation: $20-50, RVSP and completed Venmo @mfleit needed to register.\n\nnotaflof - If money is an issue contact m.t.fleit@gmail.com\n\nPS - Soft arrival 5:30, doors close and begin at 6:00. Arrive early to land!\n\nPPS - Here's some info about the container, to give you a better sense of what this is and how it's held:\n\nSeven Agreements - These are firm. If you agree with them, welcome to the space.\n1 - Confidentiality.\n2- Honor yourself. Trust your knowing of your limits. Take responsibility for yourself and your needs.\nThere is a STOP lever on the train.\n3 - Honor others. Be kind and respectful.\n4 - Don’t try to save or fix. Don’t give advice. Don’t assume someone is asking for help because they share, or need anything because they are visibly emotional.\n5 - Practice Responsibility. Own your experience 100% and allow others to do the same. Speak from the “I”. Own your assumptions. Own your stories.\n6 - No gossip. Don’t speak disparagingly about anyone who is not present. Don’t reveal personal information about anyone who is not present.\n7 - We agree to stay until the end.\n\n\nSeven Suggestions - Invitations for our time together.\n1 - Be all in. Play full out. Your full participation will serve the most rich experience for yourself and the collective.\n2 - Attunement. Practice deep listening. Sense in whether who may be one to carry the collective unfolding in each moment and the next. Beware of hijacking. Try to track where the most energy is rather than whats the latest or the loudest.\n3 - Authenticity. Reveal, don’t conceal. Don’t withhold authentic expression to manage your reputation, the feelings of others, or to be “nice” or “polite”.\n4 - Play outside of your regular comfort zone. The discomfort of vulnerability and venturing into the unknown is often just before the good stuff.\n5 - Be curious. Approach things with an open mind and heart. Seek to see the humanity in others. Understand where you do not is more likely a reflection of yourself than anything about them.\n6 - We’re in this together. This is an interconnected collective experience which extends beyond being a separate individual. Be fully present when others are sharing or getting support. They are you and may be an “asset” and exactly what you’d most benefit from being present with.\n7 - Enjoy. Play. Have fun.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "UMu9GDPquKSKp3Qi1PZH",
    "name": "Sincere Singles Social",
    "start_date": "2024-07-25T23:00:00.000Z",
    "end_date": "2024-07-26T02:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$27",
    "imageUrl": "https://partiful.imgix.net/user/5SzTjHLJ84XsZNhppKoVvDXwUrJ3/ue8wd9E0Kwu5RAzTMeGHK?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/UMu9GDPquKSKp3Qi1PZH",
    "summary": "Feeling Swiped Out?\n\nLooking to connect with local singles while mastering intimate connection skills that will enhance all your relationships?\nThe Sincere Singles Social welcomes men, women, and non-binary people, whether monogamous or non-monogamous. Our aim is for you to connect with all other attendees, whether you're open to them as a friend, date, mate, or something else great! We offer a chance to practice sincere, playful connections with everyone, helping you have fun while honing your skills to find exactly what you're looking for.\n\n--Is This Event Right for You?--\n\nIf you desire...\n - Better dates with more intimacy and ease\n - Deep and meaningful conversations\n - Exciting new connections - romantic and platonic\n - An opportunity to explore and overcome your dating obstacles\n - Playful yet sincere communication\n - A space to safely stretch yourself\n - Intimate connection skills that you can apply in dating and beyond\n...then this event is perfect for you!\n\n--What to Expect--\n\nThink of it as borderless speed dating. You’ll engage with everyone through various activities, getting to practice storytelling, flirting, boundaries and more!\n\n - Cost: $40. Earlybirds available for $27 (until July 17). Book early to secure your place!\n - Location: Private Residence in Battery Park City. Details will be sent out a couple days before the event.\n - Time: 7pm doors; 7:30-9:30 main event; 10pm doors.\n - Dress code: Whatever makes you feel comfortable and attractive. You might be sitting in chairs or on the floor.\n\n--The Facilitators--\n\nElize Simon (she/her)\nI'm a tantric sex, relationship, and body-love coach based in NYC. My passion is helping people bring their most vibrant selves to relationship so they can be seen and cherished. I love creating spaces where people can learn about themselves and each other while in flirtation and fun! As a coach, I create a space of shamelessness for my clients, where they can feel themselves a part of creation, worthy of as much love as any leaf, sloth, or mushroom.\nFor Insta, check out @elize.simon\n\nAndy Rad (he/him)\nI am dedicated to cultivating embodied connection in our world. Since 2017, my journey has revolved around Circling, a relational meditation practice I cherish for its ability to create profound spaces where we shed our social masks and embrace intimate, unfolding moments. My facilitation blends various modalities that have been pivotal to my personal growth including meditation, yoga, breathwork, bodywork, men’s work, dance, tantra, and plant medicines, all in service of connection.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "s8qppAzc5tFSyP8UpIYm",
    "name": "Monday Circling",
    "start_date": "2024-07-15T23:30:00.000Z",
    "end_date": "2024-07-16T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "JM",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/s8qppAzc5tFSyP8UpIYm",
    "summary": "Join Jeff Muller for a circling evening!!\nI am excited Jeff is able to step in this Monday to lead circling, I unfortunately won’t be able to be there. \n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope you’ll be there to continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator-\nJeff loves to relate vulnerably with others. So he found a home in circling. He has been certified to lead circles by the Circling Europe organization. When not circling, Jeff has family and friends he loves & he is a psychotherapist by trade.\n\nDoors will open at 7:30 and the container opens at 7:45pm. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "Ah742sWx4HhsvFPqvDJW",
    "name": "Midtown Circling",
    "start_date": "2024-07-18T22:30:00.000Z",
    "end_date": "2024-07-19T01:30:00.000Z",
    "location": "Sign in to see location",
    "price": "$27",
    "imageUrl": "https://partiful.imgix.net/user/zejdQYEvnVV34XwJydnQvSIKcbO2/35e24f7d-8187-4d01-89?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/Ah742sWx4HhsvFPqvDJW",
    "summary": "--What is Circling?--\nCircling is a relational meditation practice.\n\nWe pay close attention to what it's like to be together.\nWe slow down and listen deeply to ourselves and others.\nWe trust our curiosity and aliveness, and share what's present here and now.\nAnd if we're lucky, we get to explore the mystery beyond the veil of the known and the obvious.\n\nSome of the outcomes of Circling practice that many claim include:\n- Insights about how you show up in friendships and relationships\n- Revelations about the stories you see the world through\n- Greater skill in navigating difficult conversations\n- Confidence sharing your authentic thoughts and feelings\n- Enjoying rich, meaningful conversations with lovely people\n\n\n--Event Details--\nAll experience levels are welcome.\nFacilitated by Balwin Ratra and Andy Radzevicius.\nWe will start with connection games, followed by birthday circling, and then open into surrendered leadership circling.\nLocated near 30th St and Broadway in Manhattan.\n\nDoors open 15 minutes before the listed start time.\nPlease arrive early to let yourself settle in.\n\n\n--Cost--\n$27 sliding scale.\nTo save your spot, please Venmo @Andy-Rad\nThe funds are used to cover rent, snacks, and libations. If cost prevents you from easefully attending, please message me.\n\nHope to see you there!\nBring yourself, your aliveness, and your curiosity.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "SB43OGRta9F3e6MFClWZ",
    "name": "Brooklyn Backyard Circling",
    "start_date": "2024-08-01T23:00:00.000Z",
    "end_date": "2024-08-02T01:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://media2.giphy.com/media/ugyC0Q2BoCbYs/giphy.webp?cid=c00e53c6j8bbbeh9b350igycjuv3w9p22pz7560xamfwzs5u&ep=v1_gifs_search&rid=giphy.webp&ct=g",
    "organizer": "Masha",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/SB43OGRta9F3e6MFClWZ",
    "summary": "Circling is a relational practice that allows us to learn how to be present with our feelings while connecting to others. \nWe will spend time together bringing awareness to what is happening and arising among us: emotions, dynamics, sensations, and more. The presence and connection could create magic if we let it happen.\n\nIf you want to learn more, please visit https://www.circlingeurope.com/what-is-circling\n\n--Cost:\n$20-40 sliding scale\nVenmo @mashasha to reserve a spot (and RSVP here, please, so I can know the count).\n\n--Address:\nClinton Hill, Brooklyn, across the street from Pratt University. (You will receive the address after signing up, and the apt number a few hours before the event). \n\nIf needed help getting in, you can text me at (929) 225-4006\n\n--About me:\nI am a somatic movement educator, yoga teacher, and I am currently pursuing my psychology degree. I discovered circling two years ago and have loved it ever since, as it has shown me a better way to truly be myself with others. Still learning!",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "W8Ahy43b5SBriSglmCOc",
    "name": "Monday Circling",
    "start_date": "2024-07-22T23:30:00.000Z",
    "end_date": "2024-07-23T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "Vincenzo Minino",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/W8Ahy43b5SBriSglmCOc",
    "summary": "Join me for a circling evening!!\nI am excited to continue a weekly circling event.\n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope to see you there and continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator -\nWith a masters in science from his native city of Naples, Italy, Vincenzo came to New York City 25 years ago to pursue his current career as quality compliance director for a multinational company. Resolving conflicts between offices around the globe, he brings a unique understanding of what it takes to get another's world. He's currently attending the 4th year of training to become a licensed psychoanalyst at Gestalt Associates for Psychotherapy. He sought out Circling originally to strengthen his connection with his young daughter. Circling enriched this relationship and others through his years of weekly practice, retreats, and applying the tools daily in his relationship with Alison. He also trained with Harville Hendrix Ph.D. and Helen LaKelly Hunt Ph.D., authors of \"Getting the Love You Want\" and creators of Imago therapy. Vincenzo is committed to teaching his practice for personal and professional conflict resolution. He's especially interested in supporting men to reconcile society's rigid definition of masculinity and vulnerability in his weekly men's group.\nFor more information on Vincenzo and his offerings please visit https://www.vincenzominino.com/\n\nDoors will open at 7:30. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "98lH5bCcvsTyCk6P2i9Z",
    "name": "Authentic Relating",
    "start_date": "2024-07-24T23:00:00.000Z",
    "end_date": "2024-07-25T01:30:00.000Z",
    "location": "Sign in to see location",
    "price": "$45",
    "imageUrl": "https://partiful.imgix.net/user/1OlBWVNVqyMoz8SJxauMNCeobSV2/H-rtGe9gmiB4JBiLSDZbk?fit=clip&w=1440&auto=format",
    "organizer": "Racheli Yardeni",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/98lH5bCcvsTyCk6P2i9Z",
    "summary": "Join us on Wednesday, April 24th for an evening dedicated to presence and heartfelt connection. ✨\n\nIn a world where busyness often overshadows being, where rushing is the norm, this gathering offers a guided opportunity to slow down, reconnect with yourself, embrace the richness of your present moment experience, and engage with others authentically and wholeheartedly.\n\nPrevious events have unveiled the profound beauty that emerges when we pause, set aside distractions, fully immerse ourselves in the present, and connect deeply with ourselves and each other.\n\nGuided by AR facilitator Racheli Yardeni, this evening will introduce simple yet powerful tools for building and deepening connections in your life. You'll practice these tools through partner and group exercises, and participate in open discussions to delve into and be supported in your present experience.\n\nCome as you are (and feel free to bring a friend <3) and indulge in the nourishment of meaningful connections. ⭐️\n\n🍓 Fruit and other nourishing goodies will be provided. 🍓\n\n\nTIME ⏰  \nDoors open: 7:00pm\nOpening circle: 7:15pm-7:30pm \nAR Games and circling: 7:30pm- 9:00pm \nClosing circle: 9:15pm-9:30pm \nOpen hang: 9:30pm-10:00pm \nEvent ends: 10:00pm \n*Please arrive before 7:15pm to give yourself time to settle in and arrive before the opening circle, it is important to open this container with everyone present. 🙏🏻 \n\nADDRESS 🏡 \nWilliamsburg, Brooklyn \n- Private home address will be shared once you rsvp. \n\nCOST 💸  \n$45 \nTo save your spot RSVP here and Venmo @RacheliYardeni. \n~ There are two $30 discounted seats available - message Racheli at 646-734-0933 to claim them. \n\nClaimed. 🌹\n\nCancellation policy: there are no refunds, only credit given. If you cancel up to 24 hours before, you get full credit for the workshop of your choice, if you cancel in the same day, you receive 50% credit. \n\nABOUT ❤️‍🔥\nRacheli is a New York-based facilitator dedicated to human connectivity and wholeness through the art of transformative relating.\n\nHer workshops embrace vulnerability, self-acceptance and emotional intelligence - creating sanctuaries for people to unite with their fullness. \n\nRacheli is a certified facilitator with ART International; the leading Authentic Relating organization in the world. Her exploration of this work has brought her to developing conscious communication programs for youth oversees, facilitating team bonding workshops, and holding weekly spaces for adults in NYC since 2022.\n\n-----------------------------------------------\nA note from R:\n\nThese events are a space to slow down, be, explore, and welcome what this gift of being human is all about. It is a space to remind you that you are not alone & that you are worthy of being seen, loved, and known in all that you are. 🫀✨\n\nAll are welcome, I hope to see you there 🫶🏻\n- Racheli",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "oibjk9NQpRxCMgH1qGEy",
    "name": "Backyard Shadow Play",
    "start_date": "2024-07-21T22:30:00.000Z",
    "end_date": "2024-07-22T00:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://images.unsplash.com/photo-1503939313441-d753b6c7eb91?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxOTg2Nzh8MHwxfHNlYXJjaHw0fHxNb29ufGVufDB8Mnx8fDE3MjE0OTEwMzd8MA&ixlib=rb-4.0.3&q=80&w=400",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/oibjk9NQpRxCMgH1qGEy",
    "summary": "Bring your shadow, bring your light; bring your joy, and bring your delight; together we’ll explore being new and being free, and find out what it means to be “me”.\n\nI’ll provide personalized guidance to find something we’re each excited to to explore in the group. These can be broad themes like intimacy, sexuality, anger, play, sadness, or love, as well as very personal and specific exercises around self-exploration and self-revelation. Then, we’ll work together as a group to play with and engage in alignment with our desires. \n\nThis is a structured and facilitated exploration of relating in which we bring aspects of ourselves that are especially exciting (and often a little scary) to show.\n\nif you’d like to push your edges and try on new ways to be you, I warmly invite you. \n\n$20-$40 sliding scale\n\nvenmo @sofiajeannecaring\n\nA little about me: I'm an NYC native training in meditation since 2010 and relational practice since 2016. People know me for my expertise in Circling and relational shadow play, and my ability to identify and push psycho-social buttons.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "QuealZMkVtaCTquhreMy",
    "name": "More Shadow Play",
    "start_date": "2024-07-28T22:30:00.000Z",
    "end_date": "2024-07-29T00:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://images.unsplash.com/photo-1503939313441-d753b6c7eb91?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxOTg2Nzh8MHwxfHNlYXJjaHw0fHxNb29ufGVufDB8Mnx8fDE3MjE0OTEwMzd8MA&ixlib=rb-4.0.3&q=80&w=400",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/QuealZMkVtaCTquhreMy",
    "summary": "Bring your shadow, bring your light; bring your joy, and bring your delight; together we’ll explore being new and being free, and find out what it means to be “me”.\n\nI’ll provide personalized guidance to find something we’re each excited to to explore in the group. These can be broad themes like intimacy, sexuality, anger, play, sadness, or love, as well as very personal and specific exercises around self-exploration and self-revelation. Then, we’ll work together as a group to play with and engage in alignment with our desires. \n\nThis is a structured and facilitated exploration of relating in which we bring aspects of ourselves that are especially exciting (and often a little scary) to show.\n\nif you’d like to push your edges and try on new ways to be you, I warmly invite you. \n\n$20-$40 sliding scale\n\nvenmo @sofiajeannecaring\n\nA little about me: I'm an NYC native training in meditation since 2010 and relational practice since 2016. People know me for my expertise in Circling and relational shadow play, and my ability to identify and push psycho-social buttons.",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "rcHR8e1XuzDB5MBzvXT7",
    "name": "Relating Games Night, Hoboken",
    "start_date": "2024-07-24T23:00:00.000Z",
    "end_date": "2024-07-25T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$15",
    "imageUrl": "https://partiful.imgix.net/user/2OXLD1dC9gT8BhJ9eFGxHiPtbjl1/hYdm8MT5iWcU7WJPBh-Rf?fit=clip&w=1440&auto=format",
    "organizer": "Pete Benedict",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/rcHR8e1XuzDB5MBzvXT7",
    "summary": "Drawing from communication practices of the relational arts (what's that, you ask? see links below), participants take part in games and exercises to develop greater emotional intelligence and capacity to be more present in the moment to interpersonal dynamics. Relating games can enable participants to form deeper, more authentic connections with others, increase spontaneity and flow in interpersonal interactions, and feel a greater sense of community and belonging. This weekly group involves sitting and sharing verbally *and* also experiential games and exercises, including bodily movement and action, with some verbal introduction to orient participants. The relational arts include practices such as Authentic Relating, Circling, Council Practice, Nonviolent Communication, and other communication practices.\nHere are some links with further info:\nWhat is Authentic Relating? https://www.authrev.org/what-is-authentic-relating\nWhat is Circling? https://www.youtube.com/watch?v=JYObPaUtfH4 \nBenefits of Circling: https://www.circlingeurope.com/benefits-of-circling\n\n(This is an open community event with Venmo link directly to the bookstore for *Suggested Donation of $15. Limited spots available.)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "HLQ68q5IweJeY3TeYbdZ",
    "name": "Relating Games Night, Hoboken",
    "start_date": "2024-07-31T23:00:00.000Z",
    "end_date": "2024-08-01T01:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$15",
    "imageUrl": "https://partiful.imgix.net/user/2OXLD1dC9gT8BhJ9eFGxHiPtbjl1/hYdm8MT5iWcU7WJPBh-Rf?fit=clip&w=1440&auto=format",
    "organizer": "Pete Benedict",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/HLQ68q5IweJeY3TeYbdZ",
    "summary": "This Week's THEME: Stories in the Moment\n(Last session till fall)\n\nDrawing from communication practices of the relational arts (what's that, you ask? see links below), participants take part in games and exercises to develop greater emotional intelligence and capacity to be more present in the moment to interpersonal dynamics. Relating games can enable participants to form deeper, more authentic connections with others, increase spontaneity and flow in interpersonal interactions, and feel a greater sense of community and belonging. This weekly group involves sitting and sharing verbally *and* also experiential games and exercises, including bodily movement and action, with some verbal introduction to orient participants. The relational arts include practices such as Authentic Relating, Circling, Council Practice, Nonviolent Communication, and other communication practices.\nHere are some links with further info:\nWhat is Authentic Relating? https://www.authrev.org/what-is-authentic-relating\nWhat is Circling? https://www.youtube.com/watch?v=JYObPaUtfH4 \nBenefits of Circling: https://www.circlingeurope.com/benefits-of-circling\n\n(This is an open community event with Venmo link directly to the bookstore for *Suggested Donation of $15. Limited spots available.)",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "MJQcPyomJPtyzPaF4Jer",
    "name": "Monday Circling",
    "start_date": "2024-07-29T23:30:00.000Z",
    "end_date": "2024-07-30T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "Vincenzo Minino",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/MJQcPyomJPtyzPaF4Jer",
    "summary": "Join me for a circling evening!!\nI am excited to continue a weekly circling event.\n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope to see you there and continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator -\nWith a masters in science from his native city of Naples, Italy, Vincenzo came to New York City 25 years ago to pursue his current career as quality compliance director for a multinational company. Resolving conflicts between offices around the globe, he brings a unique understanding of what it takes to get another's world. He's currently attending the 4th year of training to become a licensed psychoanalyst at Gestalt Associates for Psychotherapy. He sought out Circling originally to strengthen his connection with his young daughter. Circling enriched this relationship and others through his years of weekly practice, retreats, and applying the tools daily in his relationship with Alison. He also trained with Harville Hendrix Ph.D. and Helen LaKelly Hunt Ph.D., authors of \"Getting the Love You Want\" and creators of Imago therapy. Vincenzo is committed to teaching his practice for personal and professional conflict resolution. He's especially interested in supporting men to reconcile society's rigid definition of masculinity and vulnerability in his weekly men's group.\nFor more information on Vincenzo and his offerings please visit https://www.vincenzominino.com/\n\nDoors will open at 7:30. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "z2Njq5NemfLvXg8eSI2b",
    "name": "Monday Circling",
    "start_date": "2024-08-05T23:30:00.000Z",
    "end_date": "2024-08-06T02:30:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/qxXydmqat7XZATDS412a00yBGrw2/UaAktREQQJNcp7jiKfj1x?fit=clip&w=1440&auto=format",
    "organizer": "Vincenzo Minino",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/z2Njq5NemfLvXg8eSI2b",
    "summary": "Join me for a circling evening!!\nI am excited to continue a weekly circling event.\n\nMonday gatherings are a time to be fully present, to speak from the heart, and to form connections that are profound and authentic.\n\nI hope to see you there and continue building together the most amazing, vibrant, diverse community of seekers, each on their unique path of self-discovery.\n\n- What is circling -\nCircling is a form of interpersonal communication and relational practice that focuses on deep and authentic connection with others. In a circling session, a group of individuals sits together and engages in a structured conversation, with an emphasis on being present and attuned to each other's feelings and experiences.\nFor more info on Circling try visiting:\nhttps://www.circlingeurope.com/what-is-circling\n\n- About the Facilitator -\nWith a masters in science from his native city of Naples, Italy, Vincenzo came to New York City 25 years ago to pursue his current career as quality compliance director for a multinational company. Resolving conflicts between offices around the globe, he brings a unique understanding of what it takes to get another's world. He's currently attending the 4th year of training to become a licensed psychoanalyst at Gestalt Associates for Psychotherapy. He sought out Circling originally to strengthen his connection with his young daughter. Circling enriched this relationship and others through his years of weekly practice, retreats, and applying the tools daily in his relationship with Alison. He also trained with Harville Hendrix Ph.D. and Helen LaKelly Hunt Ph.D., authors of \"Getting the Love You Want\" and creators of Imago therapy. Vincenzo is committed to teaching his practice for personal and professional conflict resolution. He's especially interested in supporting men to reconcile society's rigid definition of masculinity and vulnerability in his weekly men's group.\nFor more information on Vincenzo and his offerings please visit https://www.vincenzominino.com/\n\nDoors will open at 7:30. \nPlease try your best to arrive on time, late arrival can be disruptive. \n\n- Location - \n25th Street, Manhattan btw 6th and Broadway\n(Full address will be provided after sign-up)\n\nIf you need help getting in, you can text me at (646) 256-3140\n\n\nCost: $35-45 sliding scale\nPlease Venmo @vmini",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "FVTz0RfXgGa5VlCw5Hnb",
    "name": "Empowering Authenticity",
    "start_date": "2024-08-07T23:00:00.000Z",
    "end_date": "2024-08-08T01:30:00.000Z",
    "location": "RSVP to see location",
    "price": "$50",
    "imageUrl": "https://media4.giphy.com/media/xT77XUHgj7vDdnbiFi/giphy.webp?cid=c00e53c6orwlbi0mk8q3proy4tf1sfgccvlrzoz5f74dpo1s&ep=v1_gifs_search&rid=giphy.webp&ct=g",
    "organizer": "Racheli Yardeni",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/FVTz0RfXgGa5VlCw5Hnb",
    "summary": "You are invited to an empowering evening of authenticity and connection, where we will blend the powerful practices of Authentic Relating and Access Consciousness. ⭐️\n\nAuthentic Relating offers tools to cultivate deeper, more fulfilling relationships, while Access Consciousness provides insights to connect with your inner knowing, expand your consciousness, and live fully.\n\nFacilitated by Racheli Yardeni, the evening's purpose is to bring you in deeper connection to yourself and your unique knowing so that you can show up in this world as your authentic self, and live life in alignment with what's true for you. \n\nThe session will include exercises that center you in the present moment, help you explore and embrace your evolving self, and empower you to practice self-allowance and authentic expression while supporting others in doing the same.\n\nThis evening is for you if:\n- You desire to deepen your self-connection and be more of you. \n- You wish to live life on your own terms and fulfill your desires.\n- You seek to enhance intimacy and improve all your relationships.\n- You aim to empower others to express their most authentic selves.\n\nImagine living from a place of self-awareness, authenticity, and celebration, and extending that connection to enrich your relationships with others.\n\nWhat else is possible now that you haven't even imagined? \n\nTIME ⏰  \nDoors Open: 6:45pm\nOpening Circle: 7:00pm-7:15pm \nExercises and Circling: 7:15pm- 9:15pm \nClosing Circle: 9:15pm-9:30pm \n*Please arrive before 7:00pm to give yourself time to settle in and arrive before the opening circle, it is important to open this container with everyone present. 🙏🏻 \n\nADDRESS 🏡 \nRandy Warshaw Studio\n115 Wooster Street, 2F\nSoho, New York\n\nCOST 💸  \n$50\nTo save your spot RSVP here and Venmo @RacheliYardeni. \n~ There are three $30 discounted seats available - message Racheli at 646-734-0933 to claim them. (2/3 Claimed 🌹)\n\nCancellation policy: there are no refunds, only credit given. If you cancel up to 24 hours before, you get full credit for the workshop of your choice, if you cancel in the same day, you receive 50% credit. \n\n🍓 Fruit and other nourishing goodies will be provided. 🍓\n\nABOUT ❤️‍🔥\nRacheli is a New York-based facilitator dedicated to human connectivity and wholeness through the art of transformative relating.\n\nHer workshops embrace vulnerability, self-acceptance and emotional intelligence - creating sanctuaries for people to unite with their fullness. \n\nRacheli is a certified facilitator with ART International; the leading Authentic Relating organization in the world, and an Access Bars facilitator with Access Consciousness. Her exploration of this work has brought her to developing conscious communication programs for youth oversees, facilitating team bonding workshops, and holding weekly spaces for adults in NYC since 2022.\n\n-----------------------------------------------\nA note from R:\n\nThese events are a space to slow down, be, explore, and welcome what this gift of being human is all about. It is a space to remind you that you are not alone & that you are worthy of being seen, loved, and known in all that you are. 🫀✨\n\nAll are welcome, I hope to see you there 🫶🏻\n- Racheli",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "7TiJ7AtfhwmZoK2qIxSa",
    "name": "The Goddess Circle - Full Moon Rooftop Edition",
    "start_date": "2024-07-22T23:00:00.000Z",
    "end_date": "2024-07-23T02:00:00.000Z",
    "location": "Sign in to see location",
    "price": "$40",
    "imageUrl": "https://partiful.imgix.net/user/tkdG0PcZCxhvuRI1bAE5GkxVo8W2/ea24f2d0-642a-4076-b8?fit=clip&w=1440&auto=format",
    "organizer": "ED",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/7TiJ7AtfhwmZoK2qIxSa",
    "summary": "We are back for the Buck Full Moon in Capricorn Monday, July 21st on a Gorgeous Bushwick Rooftop! We are calling in glorious weather and don’t worry if it rains we still have a beautiful sanctuary to bask in each others beauty! Prepare for a surge of ambitious drive as July’s Capricorn full moon lights up your inner fire.\n\nLet’s celebrate and actualize or innate gifts and remember HERstory together in sacred sisterhood! \n\nThis month we will embody the Goddess \nDhumavati who is described as a giver of siddhis (supernatural powers), a rescuer from all troubles and granter of all desires and rewards, including ultimate knowledge and moksha (salvation).\n\nLet's release our troubles and call in our desires by activating our powerful life force energy & return to love together as we radiate our divine connection to the universe through ancient Goddess Teachings, Rituals and embodiment practices to deepen our relationship with our authentic self.\n\nEVENING ITINERARY:\n\nDOORS AT 7PM, CEREMONY BEGINS AT 7:30PM\n\n-TANTRIC TEACHINGS, BREATHWORK & SENSUAL EMBODIMENT DANCE\n-GUIDED BREAST MASSAGE & YONI YOGA \n-GUIDED SOUND MEDITATION\n-SACRED SISTERHOOD CLOSING CIRCLE\n-LIGHT SNACKS AND REFRESHMENTS \n\nWHAT TO BRING:\n-AUTHENTIC SELF & PILLOW TO SIT ON\n-FLOWERS OR FRUIT AND/ OR ANY TALISMANS YOU’D LIKE TO CHARGE ON THE ALTER\n-COMFORTABLE/ DANCE ATTIRE SUGGESTED\n\nEXCHANGE:\nBRING A SISTER & SAVE! - 2 TICKETS FOR $70\nINDIVIDUAL TICKETS $40 EACH\n\nLimited Capacity for maximum intimacy! Venmo @out_dorz or PayPal: eringdempsey@gmail.com to save your seat! \n💺 h",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "904066105057",
    "name": "HEALING LOSS AND THE BODY IN MOTION",
    "start_date": "2024-09-13",
    "end_date": "2024-09-15",
    "start_time": "16:00",
    "end_time": "18:00",
    "timezone": "America/New_York",
    "location": "17 Cricketown Road, Stony Point, NY 10980",
    "price": "305.96 USD",
    "imageUrl": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F765878569%2F246113557166%2F1%2Foriginal.20240513-031434?w=512&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C275%2C1650%2C825&s=5fca9dc9bf9c8fac31570835529de3c5",
    "organizer": "Karen Ritscher",
    "organizerUrl": "https://www.eventbrite.com/o/karen-ritscher-80107312213",
    "eventUrl": "https://www.eventbrite.com/e/healing-loss-and-the-body-in-motion-tickets-904066105057",
    "summary": "Healing Loss and the Body in Motion: A  residential 5Rhythms® Heartbeat workshop combined with the Externalization Work of Kübler-Ross.",
    "tags": [],
    "min_ticket_price": "305.96 USD",
    "max_ticket_price": "359.32 USD",
    "source": "Eventbrite"
  },
  {
    "id": "941191618467",
    "name": "Vulnerable AF: Deeper Speed Dating for Singles",
    "start_date": "2024-08-13",
    "end_date": "2024-08-13",
    "start_time": "18:00",
    "end_time": "21:00",
    "timezone": "America/New_York",
    "location": "12-16 Vestry Street #4th Floor, New York, NY 10013",
    "price": "60.54 USD",
    "imageUrl": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F817404969%2F199584330664%2F1%2Foriginal.20240730-201928?w=512&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C22%2C1920%2C960&s=7248b7d0cb07b53773a1747b119a2736",
    "organizer": "Vulnerable AF, LLC",
    "organizerUrl": "https://www.eventbrite.com/o/vulnerable-af-llc-30754476844",
    "eventUrl": "https://www.eventbrite.com/e/vulnerable-af-deeper-speed-dating-for-singles-tickets-941191618467",
    "summary": "Not your \"typical\" speed dating event for singles in NYC",
    "tags": [
      "Other",
      "Health & Wellness",
      "Class, Training, or Workshop",
      "singles",
      "dating",
      "vulnerable",
      "deeper",
      "nathan"
    ],
    "min_ticket_price": "60.54 USD",
    "max_ticket_price": "71.21 USD",
    "source": "Eventbrite"
  },
  {
    "id": "NYSy1PBBwJxsPzJ7ZHX0",
    "name": "Threads Of Belonging Festival & Retreat",
    "start_date": "2024-06-15T17:00:00.000Z",
    "end_date": "2024-06-15T22:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/ROOJ0nPROKW01llwPhlPV4fLvJF2/xnr_I1KGo_a_4vyJczd6Q?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/NYSy1PBBwJxsPzJ7ZHX0",
    "summary": "🧩 PLEASE READ DESCRIPTION:\n\nJoin us at our Threads Of Belonging Festival & Retreat in Brooklyn on June 15th celebrating and exploring community and connection! We welcome you to show up as you are, guiding you through multiple creative activities, games, healing arts and more to unravel what it means and feels like to belong. There will be plenty of opportunities to mix and mingle, eat and make meaningful raelationships through self-exploration! \n\n🎟️ TICKETS: $40-60 Sliding Scale:\n\nBronze ($40): Designed for those facing financial challenges, covering food, materials, and programming expenses.\n\nSilver ($50): Perfect for those who can comfortably contribute more, helping us balance costs and support others in need.\n\nGold ($60): If you have the means, select this option to support our community and keep the event affordable and inclusive.\n\nDonate To The Human Arts Collective 🫂: Your donation beyond a ticket supports event longevity, accessibility, and growth. Thank you!\n\nCosts reflect coverage for food, materials, supplies & creative programming 💕\n\n👇DESCRIPTION AND BREAKDOWN 1-6pm:\n\nA chance to explore and investigate belongingness through many lenses—dance/movement, mindfulness, sound/music, painting/drawing, photography, food, collage, mirrors, storytelling/poetry, authentic relating/deep conversations, and more!\n\nWhat does it feel like, and what’s needed to drop into a sense of belonging with myself, my environment, another, and my community?\n\n𓊍 Upstairs: A self-explorative chill out area inclusive of an art corner, photo station, mirror affirmations, games, food, typewritten poems...\n\n🛝Downstairs: Facilitated activities and guided workshops for creative connection.\n\nHere are some of the many activities to look forward to and what our agenda will include:\n\n• Opening Circle\n• Contact Beyond Contact Dance\n• Inside Out/Outside: Expressive Arts & Identity\n• Iron Chef (Creative cook-off and meal sharing)\n• Sound bath for restful digestion\n• World Building (A creative world we build together through role-play, character building, multiple art forms...)\n• Collaborative soundscape and music-making (Inc. See You On The Other Side)\n• Storytelling Party Jam (Think telephone the game but with art and stories)\n• Closing with a labyrinth of our expressions\n\nCome as you are and have a great time while meeting new people and deepening bonds!\n\n👉WHAT’S PROVIDED: A nutritious lunch, snacks, tea, games, and creative materials!\n\n👉WHAT TO BRING: A mug, journal, and feel free to bring any instrument or creative materials that inspire your expression. Wear something comfy you feel good about painting and moving in 🎨💃🏼\n\n👉MEET YOUR HOSTS: Jamie Lazan and Maddie Fontaine:\n\nJamie (she/her): Founder of The Human Arts Collective, is an expressive arts facilitator, playful guide, educator, and creative mentor with a background in trauma and resilience work. She is devoted to designing and facilitating creative, safe spaces where our expression, stories, and wellbeing can be unleashed, heard, seen, and valued. She is grateful to work with all ages ~ kids and adults alike.\n\nMaddie (she/her): A playful and imaginative guide into the world of embodied movement, authentic human connection, and creative expression. With a background in meditation, yoga, adventure therapy, and dance education, she enjoys weaving the tranquility of mindfulness with the joy of improvisation.\n\n🫂CONNECT WITH US:\nIG: @thehumanartscollective\nWhatsApp Link: https://chat.whatsapp.com/FYok8DK5zeK4qTSN8kcTYe\n\n🗣️What people have been saying about our belonging workshops:\n\nThis event was a playground for artistic expression. Thank you for a hosting a beautiful journey for our hearts. - Kendra W.\n\nAnother fun & therapeutic expressive ART session with The Human Arts Collective. Really enjoyed my experience with the participants; sharing & expressing ourselves. - Yimilya I.\n\nHave questions/needs? Please email us at thehumanartscollective@gmail.com\n\nSee you soon! 🫧💕",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "Mr8RtNrkR7N4lpzGJtm1",
    "name": "The Mush",
    "start_date": "2024-06-18T22:30:00.000Z",
    "end_date": "2024-06-19T02:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/8EorOP0ilkdDVOmG5VjgO2IbRQ62/4a27706d-f8b0-4b86-a3?fit=clip&w=1440&auto=format",
    "organizer": "",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/Mr8RtNrkR7N4lpzGJtm1",
    "summary": "*Please read event description in its entirety*\n\nWelcome to the Mush, a values-oriented, agreements-based, touch-positive space.\n\nA big pile of humans, celebrating a culture of Safety, Love, Authenticity and Autonomy.\n\nThe world’s first structured cuddle puddle and touch-positive consent training. The event has many aspects: philosophy, consent & communication practice, self-care extravaganza, many-handed healing touch opportunities, slow-motion contact dance, and more.\n\nOur vision is to create touch-positive communities here in NYC and around THE WORLD! We require everyone to first attend the “Welcome Mush” to get oriented around community values, agreements and all the other tools & skills we need to cuddle safely together 💛\n\nSee the Agenda for the Welcome Mush below 😊\n\n· 6:30 - 7:00 – Welcome Period (Doors Open)\n· 7:00 - 7:20 – Opening Circle (Group Sharing, What is the Mush?)\n· 7:20 - 8:00 – Sharing & Practicing Community Agreements\n· 8:00 - 8:30 – Consent & Communication Exercises\n· 8:30 - 9:00 – Creating THE MOST INCLUSIVE cuddle puddle on earth (aka the Mush, as seen above!)\n· 9:00 - 10:00 – Open Mush Time\n· 10:00 - 10:20 – Closing Circle (Group Sharing & Integration)\n\nAssuming you successfully complete the Welcome Mush and demonstrate you have a good understanding of the skills needed to safely navigate the space, you’ll be able to cuddle freely at future events with other people that have completed the Welcome Mush!\n\nThis is a place to open your heart and experience love and acceptance from the whole community 💖 We will revel in the beauty of touch, healthy boundaries, subtle non-verbal communication, and exploring the connection of human bodies in an explicitly non-sexual container. We also ask that everyone comes in a state of sobriety and sensitivity that supports full awareness of their own and others' boundaries.\n\nTo create a safe container for this exploration, it's only possible to join the event and receive the location if you agree to honor the Community Agreements and complete a short questionnaire. These agreements support the core values of the Mush: Safety, Love, Authenticity and Autonomy. Please review the Community Agreements and complete the questionnaire at https://forms.gle/ymWgkvhTdU5KS1Ff6 . We’ll also be discussing and practicing the agreements during the event 😊\n\n· Doors open at 6:30 pm, Opening Circle starts at 7:00 pm, Doors close at 7:20 pm\n· Wear comfy clothing that helps you feel relaxed\n· Some snacks will be provided and you’re welcome to bring snacks to share with the group \n\nJoin us for an evening where every touch is an expression of kindness and every interaction is a step towards deeper connection. We would love to see you there 💛\n\nWe will never turn someone away due to lack of funds. If cost is an issue, work exchange in support of the event is possible. Please reach out to themushcommunity@gmail.com .\n\nAbout the Facilitator:\n\nMihir Shah first discovered the Mush on the island of Koh Phangan, Thailand. Never having heard of “cuddle parties” before 🤔, he was nervous, but curious about what the experience could be like. After that first event, he fell in love with the community, values and agreements of this touch-positive space. He loved it so much that he attended the Mush Movement Facilitator Training hosted by Mush Movement Founder Davi Rhein. Now, Mihir is committed to share the experience of the Mush in NYC. To learn more about the Mush and its origins, check out https://www.mushmovement.com/home",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  },
  {
    "id": "6UZ96o61krQOOtgqSqq8",
    "name": "lovelace labs",
    "start_date": "2024-06-28T15:00:00.000Z",
    "end_date": "2024-06-28T20:00:00.000Z",
    "location": "Sign in to see location",
    "price": "",
    "imageUrl": "https://partiful.imgix.net/user/HaRFZ8Z1DDdIFAsguUJtod6g0O63/BnoA3G1znZcckM_DoZZNY?fit=clip&w=1440&auto=format",
    "organizer": "DR",
    "organizerUrl": "",
    "eventUrl": "https://partiful.com/e/6UZ96o61krQOOtgqSqq8",
    "summary": "def codeWithGals():\n\n    \"\"\"\n    Hey! Join us at Fractal HQ every week with some gals to code and cowork together. \n    No coding experience necessary. If you have any questions, reach out to Dorothy and Andrew.\n    \"\"\"\n\n    if you.identify_as(a='gal'):\n        lovelace_labs.welcomes(you)\n        return enjoy_coding(together=True)\n\ncodeWithGals()",
    "tags": [],
    "min_ticket_price": "",
    "max_ticket_price": "",
    "source": "Partiful",
    "referrer_source": "WhatsApp"
  }
]