[
  {
    "startDate": "2025-08-26T18:30:00.000-04:00",
    "endDate": "2025-08-26T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-26T18:30:00.000-04:00",
    "endDate": "2025-08-26T20:00:00.000-04:00",
    "name": "Now Showing: Clue The Movie (7:30-9pm)",
    "location": "Other Spaces",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Who killed who, with what, and in which fabulous room? Find out at 7:30pm Tuesday & Wednesday evenings on the Wastelands as we serve up Clue on the big screen! \r\nEnjoy the movie that inspired Summer Camp 25’s theme. Watch, be inspired & Perhaps even act out your dirtiest drive-in movie fantasies! (Weather permitting)"
  },
  {
    "startDate": "2025-08-26T21:00:00.000-04:00",
    "endDate": "2025-08-27T00:00:00.000-04:00",
    "name": "Whodunnit?! Happy Hour (9:00PM - 12:00AM)",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T08:30:00.000-04:00",
    "endDate": "2025-08-27T10:00:00.000-04:00",
    "name": "Wadsworth's Welcome! Scavenger Hunt Kick-Off",
    "location": "Camp-Wide",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T08:30:00.000-04:00",
    "endDate": "2025-08-27T10:00:00.000-04:00",
    "name": "Breakfast",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T12:30:00.000-04:00",
    "endDate": "2025-08-27T14:00:00.000-04:00",
    "name": "Lunch",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T12:30:00.000-04:00",
    "endDate": "2025-08-27T14:00:00.000-04:00",
    "name": "Friends of Bill/ RITL (1:00-2:00)",
    "location": "Other Spaces",
    "organizers": [],
    "description": "Friends of Bill daily meetings will be facilitated in the style of RITL (Recovery in the Lifestyle), a fellowship based on the 12 Steps and the 12 Traditions. The meetiings are available to folks in any kind of recovery and thier supporters. You do not need to be a 12-step participant to attend and participate. All those in recovery, and their supporters, are welcome!"
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Rope Handling: Find Your Flow",
    "location": "Pavilion",
    "organizers": [
      "Sassy",
      "Fearles",
      "Fearles Masochists"
    ],
    "description": "Do you want to control your ropes better? Are you looking for techniques to help you tie more quickly, with better flow, and with consistent tension? If so, this is the class for you. In this hands-on class for all levels, you will learn how to better control your tension and flow. Using exercises and practice techniques, we will explore how to most effectively control your rope to tie more efficiently and fluidly. You should bring two to three hanks of rope (30ft hanks) and your cutting tool.\n\nThis class is accessible for partnered tying or self-tying. To participate in this class:\n- The person tying must know how to tie a single column. \n- The person being tied must have a comfort with and desire to be in rope.\n- Self-tyers should be comfortable with all the above."
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Electric Edgeplay",
    "location": "Dungeon Class Tent",
    "organizers": [
      "Madeline",
      "Alex"
    ],
    "description": "This class focuses on close-in, usually hand-held electricity-delivering devices that deliver a maximum amount of pain with a minimum of effort. We will cover how electricity works, as well as its effects on the human body, with a focus on safety. We will cover the types of play that lend themselves well to close-in electrical play. And then we will discuss and demonstrate some fun, unique toys as well and ways to get the most out of the electric toys that you already have."
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Kinky D&D: Clue edition (2-5pm)",
    "location": "Dining Hall Deck",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Level Up your Play!",
    "location": "Sex-O-Rama",
    "organizers": [
      "Taylor"
    ],
    "description": "Do you want to take your kink to a level beyond basic negotiations? Are your scenes falling a little flat? New to kink altogether?  There are many factors that influence the quality of our scenes and our play.  In this interactive lecture we will explore some of those factors and equip you with ways to take “just another scene” and make it a compelling experience.  All experience levels and roles/identities welcome.  Participation not required."
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Kidz Rule! Age Play For Consenting Adults",
    "location": "Barn Class Tent",
    "organizers": [
      "Lolita Wolf"
    ],
    "description": "Age Play is fantasy role play where the reality of your and your partner's (or partners') age and/or gender does not matter. We are talking about consenting adults here - this is not about pedophilia! Age play can be for a scene or can be incorporated into a 24/7 relationship. It might include sex, D/s SM or not. Come and learn how to be a kid again! Or how to relate to someone who likes to be a kid!"
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "Genderfuckery",
    "location": "Temple Space",
    "organizers": [
      "Alixzander"
    ],
    "description": "We express our genders (or lack thereof) in many ways. However, it can feel dysphoric when our inner vision of our gender expression feels incongruous with our outer physical execution. This class is intended to help you get in touch with your body, and explore ways to bring your physicality more in line with the way you want to express your gender. We will be discussing how society’s expectations of gender expression play a role in how one's physicality is perceived, and how someone can use these often restrictive expectations to their advantage when trying to match their physicality to their gender presentation. This class is a combination of discussion and accessible exercises, and designed to be a safer space to explore and have fun with your body and gender expression"
  },
  {
    "startDate": "2025-08-27T14:30:00.000-04:00",
    "endDate": "2025-08-27T16:00:00.000-04:00",
    "name": "\"Beyond Cuddles: The Aftercare Talk (ION Tent) \"",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Whine & Cheese (5-6pm)",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "The Spark Between Us: Games for Curiosity, Consent & Connection",
    "location": "Dungeon Class Tent",
    "organizers": [
      "Marcia B"
    ],
    "description": "Ready to flirt with truth, play with boundaries, and feel the heat of real connection? In this playful, body-based experience, we’ll explore consent, desire, and authentic expression through games that spark curiosity and connection. Come as you are, bring your whole self—and maybe leave a little more turned on by life."
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Newcomer Orientation: Welcome to Dark Odyssey! (5:15pm to 6pm)",
    "location": "Dining Hall Deck",
    "organizers": [
      "Sejay"
    ],
    "description": "New here? Nervous about attending your first event? Come enjoy a short and entertaining introduction to play conferences and get a warm welcome to our Dark Odyssey kink-sex-spirit community. Orientations are only 45 minutes, offered multiple days and times on the schedule, and first-timers receive a free cherry pin for attending! Get the skinny on navigating this scintillating environment, play party etiquette, and how to engage with folks in our magical consent-based culture. We'll give you a layout of the luxurious grounds setup, model the amazing scene you'll see throughout the conference, guide you through interactive learning activities like Sejay's patented \"flirting or gross?\" game, and provide pro tips for maximizing your good time. Whether you’re new to the scene, curious, cautious, or excited to dive in, stop by to meet fellow newcomers, get a lay of the land, and kick off your adventure feeling confident, connected, and ready to go!"
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Successfully Navigating the Public Scene for Age Players",
    "location": "Sex-O-Rama",
    "organizers": [
      "Lady Plume"
    ],
    "description": "Age-related role play is much more than cute girls wearing diapers. It covers any activities where consenting adults interact as older or younger personas and may include age regression, childlike play, power exchange, role play, BDSM/kink, sex, and fetishes. This interactive class will discuss how to identify your favorite aspects of age play and use that knowledge to successfully navigate the public BDSM and/or age play communities. We will cover expectations; general etiquette; appropriate behavior towards other age players; and consent for different types of events."
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Death By “Snu Snu” & “Glitter” Part 1: Mandatory Meetup",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Falling Out Of Love With Goodness",
    "location": "Dungeon Trees",
    "organizers": [
      "Redwood"
    ],
    "description": "Have you recently lost interest in being a “good”, at well.. Anything? A good person, a good friend, a good partner, a good neighbor, etc. What I’ve been spending my time and energy on now is “I just wanna like the ways I’m be-ing with people”. Of all the humans that ever existed, only you can know what it means to “like” something - it’s one of the most personal and private and hard to explain things, what it means when we “like” something. In this class we’ll learn how to create a habit/way of learning and knowing the many ways each of us likes to be with/towards people, and how to live submerged inside that heart space."
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Invisible Toybox",
    "location": "Temple Space",
    "organizers": [
      "HG Wyndell"
    ],
    "description": "Magic, chi, ki, woo, vibes, all of these terms, and more have been used to describe the quality called “energy.” In this class, we will learn techniques for manipulating energy, and briefly discuss the ethics of energy play, and ways to incorporate energy into BDSM, for connection, play, and intimacy."
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Off Body Hooping",
    "location": "Pyro Playground",
    "organizers": [
      "Ropey_Raccoon"
    ],
    "description": "An introduction to on body hula hoop skills including waist hooping, knee hooping, and chest hooping (and maybe even boob hooping!) . All skill levels are welcome, no previous hoop experience is required. We will have hoops available to borrow, but feel free to bring your own if you have one"
  },
  {
    "startDate": "2025-08-27T16:30:00.000-04:00",
    "endDate": "2025-08-27T18:00:00.000-04:00",
    "name": "Fat Mixer",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T18:30:00.000-04:00",
    "endDate": "2025-08-27T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T18:30:00.000-04:00",
    "endDate": "2025-08-27T20:00:00.000-04:00",
    "name": "Fire Spinning Safety Training (7pm--8pm)",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "(Takes place during the first 40 minutes of Fire Spinning Safety Training)\nALL fire related activities have a high risk profile and require a lot of attention to safety. This class will cover best practices on how to both safely spin and be a safety for others. This includes things like, the spinner to safety dynamic/communications, fuels, safety blankets, clothing and what is considered “a bad idea”. We will talk about properly fueling a prop, what a fueling station should have, why fire extinguishers are ONLY a last resort, and what to do if things go south."
  },
  {
    "startDate": "2025-08-27T18:30:00.000-04:00",
    "endDate": "2025-08-27T20:00:00.000-04:00",
    "name": "Now Showing: Clue The Movie (7:30-9pm)",
    "location": "Other Spaces 2",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Who killed who, with what, and in which fabulous room? Find out at 7:30pm Tuesday & Wednesday evenings on the Wastelands as we serve up Clue on the big screen! \r\nEnjoy the movie that inspired Summer Camp 25’s theme. Watch, be inspired & Perhaps even act out your dirtiest drive-in movie fantasies! (Weather permitting)"
  },
  {
    "startDate": "2025-08-27T20:30:00.000-04:00",
    "endDate": "2025-08-27T22:00:00.000-04:00",
    "name": "YTango: Latin Dance",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-27T20:30:00.000-04:00",
    "endDate": "2025-08-27T22:00:00.000-04:00",
    "name": "CLUE Trivia Happy Hour (9:00PM - 12:00AM)",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T08:30:00.000-04:00",
    "endDate": "2025-08-28T10:00:00.000-04:00",
    "name": "Murder Mystery: Mrs. White (all day, camp-wide-",
    "location": "Camp-Wide",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Summer Camp is always full of intrigue, mystery, and a fair bit of foul play. This year, something's afoot at camp. Each day, our mysterious butler/entertainment director, Wadsworth, will give his welcome and introduce the day's news - typically, a murder most foul, which you intrepid campers can help solve by participating in a scavenger hunt.\n\nTest your detective skills at trivia night or attend a secret soiree in the mansion's ballroom, all the while looking for hidden clues among the scenery to find out the killer's identity, hiding place, and murder weapon. Locate the weapon cache for small prizes each day or complete the scavenger hunt all four days (Thurs-Sun) to be entered into a drawing for a grand prize at dinnertime on Sunday!\n\nHelp us hunt down the killers in our midst, and we’ll stack the bodies in the cellar, have a nice play party, leave quietly, and pretend this whole thing never happened."
  },
  {
    "startDate": "2025-08-28T08:30:00.000-04:00",
    "endDate": "2025-08-28T10:00:00.000-04:00",
    "name": "\"New Age\" Yoga",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T08:30:00.000-04:00",
    "endDate": "2025-08-28T10:00:00.000-04:00",
    "name": "Breakfast",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Veterinary Play & Grooming",
    "location": "Pavilion",
    "organizers": [
      "Lady Plume"
    ],
    "description": "Have fun introducing veterinarian play and grooming into your animal roleplay. This class will discuss the role of a Vet or Animal Care Team in examining and caring for an human animal of any species regardless of their existing dynamic(s). We will talk about how to roleplay well-animal exams; new pet care (feeding, setting up your household); grooming; advice on specific behavioral issues; dental checks; breeding exams (genital exams, fertilization, pregnancy); and emergency visits (needle play, catheterization, wound care, restraints). We will also discuss how caring for your animal can deepen your owner/handler & animal bond."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Thick Desire",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Marcia B"
    ],
    "description": "Desire is so much more than a fleeting urge. Beneath the surface of wanting lies a deeper truth—about who we are, what we value, and how we long to connect. In this experiential workshop, we’ll explore the difference between thin and thick desire: the distinction between surface-level urges and the rich, meaning-filled longings at the heart of our sexuality. \n\nYou’ll be invited to listen closely to the wisdom of your desire—not just what you want, but why it matters. And you’ll walk away with tools to discern this important difference."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "New Kink Ways Using Old Kink Traditions",
    "location": "Dining Hall Deck",
    "organizers": [
      "Redwood"
    ],
    "description": "In this class we’ll learn about interesting ways to engage with traditional kink - things like pretending rope is a snake and a person is a tree, and the snake crawls itself around the tree and into a harness (as snakes do.. lol!) and then gives its life to the tree, and the tree slowly becomes human, and then we do “human” things together. Or like “painting” bruises on each other by doing intentional impact play on skin to create different patterns and shapes - a temporary bruise tattoo, so to speak."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Pamporium 10:00 am — 1:00 pm",
    "location": "Sex-O-Rama",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Putting the Switch in D/s",
    "location": "Barn Class Tent",
    "organizers": [
      "Knotty Gal",
      "Temptress Ari"
    ],
    "description": "What do you call a Super Mario character who likes to be both Dominant and submissive? A Nintendo switch! This workshop is for those of us who don’t want to pick a side. Whether you switch within your dynamic, exclusively as a top/bottom, between different relationships and/or partners, or just identify as a chaotic human, this workshop is for you. Join switches Knotty Gal and Temptress Ari to talk about all things switching including switch stigma and finding balance between roles."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Power Flogging",
    "location": "Dungeon Trees",
    "organizers": [
      "Lolita Wolf"
    ],
    "description": "Learn how to get the most out of your stroke and how to have the stamina to outlast those piggy bottoms. Your body angle and footwork are also important for accuracy and achieving a variety of sensations. In addition, we'll cover different types of floggers and cats, warm up, reading the bottom, communication, and safety. Please bring a flogger for some hands on practice."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Crafting A Psycho-Emotive Ritual Kink Scene",
    "location": "Temple Space",
    "organizers": [
      "Keiden Bren"
    ],
    "description": "Have you been looking to add that sacred element into your kink scenes? Learn how to bring the Woo into your kink scenes with psycho-emotive elements to create deep emotional experiences. In this class we will discuss various elements of sacred sexuality, what goes into creating ceremony and ritual, and what a psycho-emotive experience entails to learn how to craft your scene."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Intro to Poi",
    "location": "Pyro Playground",
    "organizers": [
      "Chad"
    ],
    "description": "Come learn how to spin two balls on strings. We will cover all the basic moves, including one turn, and give you a solid foundation to build upon. Show up ready to learn, get booped a few times, and know we all look pretty silly doing this really fun stuff. No experience needed. Practice poi will be provided."
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Fused Glass",
    "location": "Other Spaces",
    "organizers": [
      "Tasty Tina"
    ],
    "description": "Come and make your own fused glass jewelry, amulet, or altar piece with colorful dichroic and art glass! Add precious metals and murrini. The materials fee is $30.00 per piece. (Please note: you must return later in the day, or the next day, to pick up your fired & completed piece.)"
  },
  {
    "startDate": "2025-08-28T10:30:00.000-04:00",
    "endDate": "2025-08-28T12:00:00.000-04:00",
    "name": "Safer Knife Play",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T12:30:00.000-04:00",
    "endDate": "2025-08-28T14:00:00.000-04:00",
    "name": "Lunch",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T12:30:00.000-04:00",
    "endDate": "2025-08-28T14:00:00.000-04:00",
    "name": "Friends of Bill/ RITL (1:00-2:00)",
    "location": "Other Spaces",
    "organizers": [],
    "description": "Friends of Bill daily meetings will be facilitated in the style of RITL (Recovery in the Lifestyle), a fellowship based on the 12 Steps and the 12 Traditions. The meetiings are available to folks in any kind of recovery and thier supporters. You do not need to be a 12-step participant to attend and participate. All those in recovery, and their supporters, are welcome!"
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Size Doesn't Matter! (Kinky Grappling for Smaller Folks)",
    "location": "Pavilion",
    "organizers": [
      "Toy",
      "House of O \n(Mr O",
      "toy)"
    ],
    "description": "Love kinky grappling but hate that you sometimes feel like your partner could crush you with just a hand? Do you long to just be able to fight back (or even dominate/crush your opponent)?? Don’t worry! Little people can do big things too!\nIn this hands-on workshop, we will look at practical ways that smaller folks can use their size to their advantage. We will also talk about safety and specific concerns when size can matter! We'll discuss fun and creative ways to make our kinky grappling play adapted when one person has a clear physical advantage and how to make this kind of play fun and safe for everyone, no matter the size!"
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Hair, Mouth and Face Rope",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Sassy",
      "Fearles",
      "Fearles Masochists"
    ],
    "description": "In this dynamic and engaging class, you'll explore the art of tying hair, mouth, and face. Learn various techniques for tying these sensitive areas of the body and expand your sadistic rope skills. We will cover safety considerations and multiple options for tying each area of the face. Whether you're looking to expand your repertoire or simply have fun with new techniques, this class offers a playful, hands-on environment where you can discover new ways to use rope for precision and impact. This class is designed to push your creativity, improve your technique, and help you bring fresh elements to your bondage practice in a practical and fun environment. You should bring two to three hanks of rope (30ft hanks) and your cutting tool.\n\nTo participate in this class:  \n- The person tying should feel comfortable tying a non-collapsible single-column tie, have an understanding of forward and reverse tension, and have knowledge of basic rope safety. Please note: single column ties are required for this class and will not be taught.\n\n- The person being tied should be comfortable with having rope on their face, and have the ability to communicate with their tying partner."
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Sartorial Sadistry: A Deep Dive into Sadistic Dollification",
    "location": "Dining Hall Deck",
    "organizers": [
      "Alixzander"
    ],
    "description": "When we think of dollification, we may think of lace, silks, soft fabrics, and pretty styles. But what if your Dolly wants to add some endorphin-pumping “spice” to their kink? “BDSM Barbie: The Art of Sadistic Dollification” provides a head-to-toe overview of the tools, techniques, designs, and accessories that can be used to make your Dolly scream and squirm, all while looking their prettiest. The class is discussion-based, with a full Dollification demonstration. Guests are encouraged to share their experiences and learn as a group. Life in (painful) plastic is fantastic!"
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Blood, Sweat, & Fears: The Art and Thrill of Blood Play",
    "location": "Sex-O-Rama",
    "organizers": [
      "Jamie Joy"
    ],
    "description": "Enter into the visceral and intoxicating world of Blood Play, where sensation and surrender meet danger and transcendence. From the sharp kiss of spiked implements to the intimate precision of cutting and cupping, we’ll explore how pain, pleasure, and power bleed together. For those who crave the sting, the drip, and the rush— this space is for you. Learn safety essentials, techniques, and the dark delicious creativity of drawing blood with intention. Whether you're a seasoned player or a curious explorer, come ready to revel in the exquisite agony of broken flesh.\n\nThis workshop is a perfect foreplay to the evening's Blood Play party. Come brush up on skills and cruise for potential play in anticipation for Dagger at the Dungeon"
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Strap-On, Get Off",
    "location": "Barn Class Tent",
    "organizers": [
      "Vonka"
    ],
    "description": "Whether strap-ons are a new addition to your boudoir or a beloved staple in your bedroom, by the end of this class you will know all of the “ins and outs” of them. Vonka will display a variety of toys and harnesses to show you the different options as well as their pros and cons. Your fearless femme leaders will talk about getting into all the holes (front, back, and mouth), how to have the best stroke game when you can't quite feel what's going on, and how to make sure you really feel it if and when you want to."
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Primal Fantasies",
    "location": "Dungeon Trees",
    "organizers": [
      "Sunny Mayne",
      "Sunny Leigh Mayne",
      "Oximus"
    ],
    "description": "Do you have an inner beast? How about a desire to be free from inhibition when you play?  From CNC hunting play to breeding, come learn about what it means to be primal. We'll discuss primal relationship dynamics, physical play, and primal lifestyle. This is an updated class with plenty of live demos. Lots of new adventures to share!"
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Spicy Tarot for Kink",
    "location": "Temple Space",
    "organizers": [
      "HG Wyndell"
    ],
    "description": "Come and join a discussion on how we can mix the art of tarot with our kinky adventures. We'll talk about using cards to create scene ideas, playing with archetypes, getting out of our heads, and opening up questions we have yet to think of. A working understanding of tarot will be helpful in getting the most out of this workshop."
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "JBG Mai Tai COCKtail Hour (2pm)",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "TNG Mixer",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T14:30:00.000-04:00",
    "endDate": "2025-08-28T16:00:00.000-04:00",
    "name": "Friendly Feet of Summer Camp 2025",
    "location": "Other Spaces 3",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Super Cool Rope Tricks for Tops Who Want to Impress Their Enemies",
    "location": "Pavilion",
    "organizers": [
      "March"
    ],
    "description": "What the title says. Rope bundles that can be thrown across your dungeon floor to assert your dominance. 2-step Somerville bowlines. One-handed slip knots. Mega fast uplines and lock-offs. How to tie with more speed and less rope gremlins(random knots that form at the running ends) or jams. Not only will you impress your friends and enemies, you will also spend more time looking at the person you’re tying instead of your rope! It’s secretly a class about rope handling."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Humiliation, Degradation, & Objectification: How to Break It Down Before Breaking Them Down",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "MrsB"
    ],
    "description": "All sorts of kinky people identify as being \"into humiliation play\" but what does that mean exactly? This class breaks down the terms and language that we use when talking about common forms of emotional sadomasochism so that we can figure out exactly what kind of play we're talking about, learn ways to navigate this play with sensitivity, and have more satisfying play with our partners. Lecture w/ time for discussion."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Speed Dating",
    "location": "Dining Hall Deck",
    "organizers": [
      "James Gordon",
      "Rebecca Doll"
    ],
    "description": "What better way to fling yourself into camp than an exciting set of meetings with new people that puts you face to face with cool people in a structured environment. In our 98.6% awkwardness-free environment, you won't have to worry about how to start a conversation! In our non-gendered speed dating, you'll network and make connections, as well as meet the playdate of your dreams! A low-risk way to meet new people without anxiety, as Rebecca Doll guides you through the rounds. Dating is open to all genders and orientations!"
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "First Impressions: Playing at events",
    "location": "Sex-O-Rama",
    "organizers": [
      "Shay Tiziano",
      "lemec"
    ],
    "description": "\"You never have a second chance to make a first impression.\" - It's an oft-repeated cliche because it's true! Many crucial \"firsts\" go into playing at events, especially with occasional or new partners; poise, finding compatible partners, confident & empathetic negotiation, reading your partner during the scene, and more. The instructors will tap into their extensive scene and public play experience to give tips & tricks to make your play soar! They will include demonstrations focused on meeting people, dynamic bottoming, quick top ideas to have up your sleeve, and utilizing/reading body language. This highly interactive session offers opportunities to assess your negotiation skills, consider your limits, and (optionally) participate in roleplay scenarios."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Fear and Gross Out Play",
    "location": "Barn Class Tent",
    "organizers": [
      "Madeline",
      "Alex"
    ],
    "description": "Fear and loathing come to the dungeon. This class focuses on figuring out what scares and grosses out your partners and finding out if that is an area that can (or should) be played with. We discuss using emotions such as revulsion and disgust in your play. Discussion of phobias vs. fears as well as respecting your playspace regarding mess or triggering play will take place. Demos will focus on what kind of reactions you can expect from your partners as well as a few idea-starters. Warning, this class does include some things that may be triggering for some (animal products, textures, sounds, and a discussion of smell)."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "After the Oops: The Art of an Effective Apology",
    "location": "Dungeon Trees",
    "organizers": [
      "Temptress Ari"
    ],
    "description": "To err is human… but what happens after that? Whether it was a miscommunication in your relationship, a faux pas at a munch, or something more serious like a boundary or consent violation, there is an art to a sincere and meaningful apology. This workshop explores the motivation of an apology before shifting to focus on skill building for how to deliver a meaningful apology, but most importantly change your behavior moving forward to make amends and rebuild trust. Part presentation to teach skills, part open discussion to talk through scenarios and application."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Impact Catharsis: The Metaphysics of Sensation",
    "location": "Temple Space",
    "organizers": [
      "Thista"
    ],
    "description": "Pain is a well-known mechanism for cathartic relief and release, but how does that work on an energetic level? How does the energy body respond to different types of sensation, and how can you use those responses to help someone achieve catharsis? Come learn how physical sensation can facilitate spiritual healing."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Beginner Dragon Staff",
    "location": "Pyro Playground",
    "organizers": [
      "Raven Rose"
    ],
    "description": "Explore a new way to express yourself through movement with this weighted contact prop. Learn basic grips and handling, building momentum and body rolls."
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Newcomer Orientation: Welcome to Dark Odyssey! (5:15pm to 6pm)",
    "location": "Other Spaces",
    "organizers": [
      "Sejay"
    ],
    "description": "New here? Nervous about attending your first event? Come enjoy a short and entertaining introduction to play conferences and get a warm welcome to our Dark Odyssey kink-sex-spirit community. Orientations are only 45 minutes, offered multiple days and times on the schedule, and first-timers receive a free cherry pin for attending! Get the skinny on navigating this scintillating environment, play party etiquette, and how to engage with folks in our magical consent-based culture. We'll give you a layout of the luxurious grounds setup, model the amazing scene you'll see throughout the conference, guide you through interactive learning activities like Sejay's patented \"flirting or gross?\" game, and provide pro tips for maximizing your good time. Whether you’re new to the scene, curious, cautious, or excited to dive in, stop by to meet fellow newcomers, get a lay of the land, and kick off your adventure feeling confident, connected, and ready to go!"
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Navigating the Intersection: Disability and Kink With TheBunny",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T16:30:00.000-04:00",
    "endDate": "2025-08-28T18:00:00.000-04:00",
    "name": "Butt Drumming!",
    "location": "Other Spaces 3",
    "organizers": [
      "Patch",
      "Patch Kyaio"
    ],
    "description": "Come join us as we explore the excitement and enjoyment of percussive impact play! Hands meet flesh in this memorable and entertaining experience of bootylicious musicality. We will be demonstrating and instructing on the intricacies and intimacies of hand drumming on someone's gluteal instrument (or other desired areas) and jamming out in sexy, slappy, mutually enjoyable drum fashion! Bring a butt/bottom!"
  },
  {
    "startDate": "2025-08-28T18:30:00.000-04:00",
    "endDate": "2025-08-28T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T18:30:00.000-04:00",
    "endDate": "2025-08-28T20:00:00.000-04:00",
    "name": "Fire Spinning Safety Training (7pm--8pm)",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "(Takes place during the first 40 minutes of Fire Spinning Safety Training)\nALL fire related activities have a high risk profile and require a lot of attention to safety. This class will cover best practices on how to both safely spin and be a safety for others. This includes things like, the spinner to safety dynamic/communications, fuels, safety blankets, clothing and what is considered “a bad idea”. We will talk about properly fueling a prop, what a fueling station should have, why fire extinguishers are ONLY a last resort, and what to do if things go south."
  },
  {
    "startDate": "2025-08-28T20:30:00.000-04:00",
    "endDate": "2025-08-28T22:00:00.000-04:00",
    "name": "Killer Stakes Casino Night 9:00 — 11:00PM - James & Rebecca Doll",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-28T20:30:00.000-04:00",
    "endDate": "2025-08-28T22:00:00.000-04:00",
    "name": "Ordeal Ritual: What Do You Want?",
    "location": "Temple Space",
    "organizers": [
      "Thista"
    ],
    "description": "The hardest questions to answer are those we must ask ourselves: What do you want? Beneath deceptive simplicity we find a nuanced web of conflicting desires, ready to tangle us up in our own contradictions. What do you want, and what will it mean to act on that desire? Uncover layers of yourself in the first steps you take towards achieving your goal."
  },
  {
    "startDate": "2025-08-28T20:30:00.000-04:00",
    "endDate": "2025-08-28T22:00:00.000-04:00",
    "name": "Dagger at the Dungeon Blood Play Party (9:00 pm-12:00 am) (Dungeon)",
    "location": "Other Spaces",
    "organizers": [
      "Jamie Joy",
      "LearningCurve"
    ],
    "description": "Step into the manor for a night of decadent debauchery. Every guest is a suspect, every stain is a clue, and every scene drips with suspense - and blood. This party is not for the faint of heart. Dress to kill. Let the games begin!"
  },
  {
    "startDate": "2025-08-28T20:30:00.000-04:00",
    "endDate": "2025-08-28T22:00:00.000-04:00",
    "name": "Fireplay 101",
    "location": "Other Spaces 2",
    "organizers": [
      "CoarseGrit"
    ],
    "description": "Are you at least a semi responsible pyro who also enjoys naked people? Want to learn how to combine them responsibly? Come to Fireplay 101. The purpose of this class is to give you the basic fundamentals of alcohol based Fireplay. We’ll go over the core basics of Safety, Negotiations, Equipment & Techniques, including fire cupping. There will be demos, QnA and lots of fun"
  },
  {
    "startDate": "2025-08-28T22:00:00.000-04:00",
    "endDate": "2025-08-29T00:30:00.000-04:00",
    "name": "Cauldron of Hope (Lower Fire Pit)",
    "location": "Other Spaces 3",
    "organizers": [
      "Patch Kyaio"
    ],
    "description": "In moments of darkness, when the path is unclear and the spirit weary, hope becomes our sacred ember. Small, glowing, and vital. We invite you to gather at the Cauldron, a living vessel where we tend our flame together. Through presence, connection, and shared intention, we will stir this brew with passion and desire. Offerings will unfold as you feel called—touch, sound, expression, stillness. And when the time is right, we will gather as one to feed the fire with our longings, our laughter, our love. Let the heat rise. Let our bodies entwine. Let our hope ignite.\nWe will drum. We will dance. We will fuck.\nWe will burn bright into the night—together, in sacred celebration."
  },
  {
    "startDate": "2025-08-29T08:30:00.000-04:00",
    "endDate": "2025-08-29T10:00:00.000-04:00",
    "name": "Murder Mystery: Colonel Mustard (all day, camp-wide-",
    "location": "Camp-Wide",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Summer Camp is always full of intrigue, mystery, and a fair bit of foul play. This year, something's afoot at camp. Each day, our mysterious butler/entertainment director, Wadsworth, will give his welcome and introduce the day's news - typically, a murder most foul, which you intrepid campers can help solve by participating in a scavenger hunt.\n\nTest your detective skills at trivia night or attend a secret soiree in the mansion's ballroom, all the while looking for hidden clues among the scenery to find out the killer's identity, hiding place, and murder weapon. Locate the weapon cache for small prizes each day or complete the scavenger hunt all four days (Thurs-Sun) to be entered into a drawing for a grand prize at dinnertime on Sunday!\n\nHelp us hunt down the killers in our midst, and we’ll stack the bodies in the cellar, have a nice play party, leave quietly, and pretend this whole thing never happened."
  },
  {
    "startDate": "2025-08-29T08:30:00.000-04:00",
    "endDate": "2025-08-29T10:00:00.000-04:00",
    "name": "Breakfast",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Intro to Pole Dance",
    "location": "Pavilion",
    "organizers": [
      "Sara WithoutanH"
    ],
    "description": "Curious to try pole? Join me for an intro class to this expressive artform! Class will start with a warmup, and review skills such as basic spins and climbing/sitting. You need skin to stick to the pole! Please wear shorts and NO lotions or jewelry."
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "All About Gags",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Lady Plume"
    ],
    "description": "Silence might be golden, but it can also be sexy, fun, and messy! This interactive class will identify different aims for head and mouth bondage and show how to select the best gag or material to ensure your success. We will learn basic safety techniques for head bondage, including anatomical concerns; breathing or compression issues; insertion and removal challenges; and maintaining non-verbal communication throughout your scene. Various gags and bondage materials will be shown. Bring your own favorite gags for a show-and-tell at the end."
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "The Feminist Pervert",
    "location": "Dining Hall Deck",
    "organizers": [
      "MrsB"
    ],
    "description": "A guided discussion intended to wrestle with the challenges kinky feminists often face in reconciling their erotic desires with feminist praxis."
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Pamporium 10:00 am — 1:00 pm",
    "location": "Sex-O-Rama",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Chronically Kinky Mixer",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "WASTELAND Triangle Suspension",
    "location": "Dungeon Trees",
    "organizers": [
      "Shay Tiziano"
    ],
    "description": "Explore dynamic movement with a minimalist and playful 'circus bondage'-style 3- to 5- point rig. An example suspension transition sequence using this structure will be demonstrated, as well as tips for flyers on taking full advantage of the freedom & flow offered by this suspension. Potential flyer-driven shapes include running person, splits, pinwheel, lotus, birdcage, pike, and many more. Unleash your inner aerialist – this is *not* traditional Shibari in any sense!\n\nThe first half of class is a lecture and demo. In the remaining time, attendees with appropriate suspension experience may try the rig and/or the sequence. During the hands-on time, attendees will need to tie all required harnesses independently.\n\nThis class is self- or partnered-suspension friendly. Anyone is welcome to observe. This is an advanced suspension class.\n\nTo participate in the hands-on portion, the pre-requisites are:\n- Tiers: This fast-moving class is not appropriate for suspension bondage beginners. Tops should know, at minimum, suspension-ready chest harness (arms-free preferred, but arms-in may be used at the discretion of the tying pair), attaching support lines, and basics of negotiation and risk mitigation for suspension bondage.\n\n- Flyers: Body and health awareness to participate safely at a level appropriate for your body. Experience with suspension ties that heavily load the chest. \n\n- Self-suspenders: Same requirements as for tiers AND flyers.\n\nSupplies: Your basic suspension kit. Synthetic/rated rope for all uplines and locking carabiners are strongly recommended; a minimum of one piece of rated rope for the critical upline is required. Instructors will have POSH and AmSteel available for attendees to borrow if needed. Flyers should ideally wear snug leggings and firm-soled shoes that can be tied over."
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Creating Energetic Containers for Kink",
    "location": "Temple Space",
    "organizers": [
      "HG Wyndell"
    ],
    "description": "Scenes start when the idea first comes into being. It then builds layers of momentum, it can be anything from a slow burn that moves over years, to an idea that flash boils. Crafting our calling in, setting the stage, and aligning our goals can turn a relatively simple idea into a powerful moment of dreaming. We'll talk about getting all of our senses on board with our brains and making magic happen."
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "On Body Hooping",
    "location": "Pyro Playground",
    "organizers": [
      "Ropey_Racoon",
      "Ropey_Raccoon"
    ],
    "description": "An introduction to on body hula hoop skills including waist hooping, knee hooping, and chest hooping (and maybe even boob hooping!) . All skill levels are welcome, no previous hoop experience is required. We will have hoops available to borrow, but feel free to bring your own if you have one"
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Fused Glass",
    "location": "Other Spaces",
    "organizers": [
      "Tasty Tina"
    ],
    "description": "Come and make your own fused glass jewelry, amulet, or altar piece with colorful dichroic and art glass! Add precious metals and murrini. The materials fee is $30.00 per piece. (Please note: you must return later in the day, or the next day, to pick up your fired & completed piece.)"
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Kinky Improv: Let’s Tell a Story…Together!",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T10:30:00.000-04:00",
    "endDate": "2025-08-29T12:00:00.000-04:00",
    "name": "Critter Cafe (11am-12:30pm)",
    "location": "Other Spaces 3",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T12:30:00.000-04:00",
    "endDate": "2025-08-29T14:00:00.000-04:00",
    "name": "Lunch",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T12:30:00.000-04:00",
    "endDate": "2025-08-29T14:00:00.000-04:00",
    "name": "Friends of Bill/ RITL (1:00-2:00)",
    "location": "Other Spaces",
    "organizers": [],
    "description": "Friends of Bill daily meetings will be facilitated in the style of RITL (Recovery in the Lifestyle), a fellowship based on the 12 Steps and the 12 Traditions. The meetiings are available to folks in any kind of recovery and thier supporters. You do not need to be a 12-step participant to attend and participate. All those in recovery, and their supporters, are welcome!"
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "The Binding Clue: Piecing Together Floor Scenes",
    "location": "Pavilion",
    "organizers": [
      "March"
    ],
    "description": "This class is designed for intermediate to advanced tying pairs who want to deepen their understanding of floorwork. We'll focus on constructing intentional scenes using foundational elements like the single column tie, hojo cuffs, and frictions.\nFloor scenes can sometimes feel either too open-ended(confusing and out of control) or too scripted(awkward and clinical). In this class, we’ll attempt to do the delicious secret third thing. You'll learn to treat each intention as a “clue,” fitting pieces together with both technical proficiency and emotional presence. Whether you are interested in spontaneous improvisation or exploring iconic positions, this class will touch upon mapping the arc of a floor scene. \nExpect a short demo to set the tone, followed by guided rope games that foster collaboration, experimentation, and playful investigation. \n\nRequirements : \n- People tying : solid single column tie, hojo cuff, at least one friction, and rope handling for floor work.\n\n- People being tied : familiarity with assessing and communicating for body awareness and safety in floor work."
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Femme Flirt",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Vonka"
    ],
    "description": "Hey there, femme. Are you feeling flirty but unsure of how to initiate? Are you rendered speechless by another femme’s allure? Let Vonka guide you through propositioning queer cuties in an empowering way without causing discomfort or uncertainty (“Were they hitting on me? Maybe they were just being nice…”). Practice without pressure in this class as we roleplay approaches and overcome our flirting fears! This class is for self-identified femmes who are attracted to other self-identified femmes."
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "High Protocol English Tea",
    "location": "Dining Hall Deck",
    "organizers": [
      "Alixzander"
    ],
    "description": "The upper echelons of British aristocracy are defined by their etiquette. This rigid, unquestionable set of rules, expectations, and standards governs everything from simple everyday social interactions to the grandest of balls. However, one event in particular holds special status within these groups as the clearest way to demonstrate one’s wealth, pedigree, and adherence to etiquette: High Tea. This class is a deep dive into High Tea Service, and is perfect for either side of the slash. We will discuss how to properly set a tea service (as well as potential variations), the proper way to plate and serve both food and tea, and expectations of staff presence during the tea. We will also discuss the expectations of guests, including how to prepare one’s cup, proper tea drinking etiquette, and conversational guidelines. Finally, we will discuss the role of the host, covering everything from the invites to the parting of ways. This class is part lecture, part hands on demonstration"
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Fisting for Every Body",
    "location": "Sex-O-Rama",
    "organizers": [
      "Trinket",
      "Sir Kitty"
    ],
    "description": "Calling all fisters, fistees and the fist curious! This class will cover the foundations of both vaginal and anal fisting: anatomy, safety, lube selection, the art of the stretch, and advanced maneuvers for those ready to level up their play. Demos will follow the educational portion. Armed with your new knowledge and excitement, stay with us for Fistfest, where you can dive wrist deep into your new skills!"
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Brat for Brat",
    "location": "Barn Class Tent",
    "organizers": [
      "Temptress Ari",
      "Knotty Gal"
    ],
    "description": "Whether you love brats or hate them, they do what they want! Join bratty switches Temptress Ari and Knotty Gal for a class covering bratting from all angles. Bratty bottoms, smart ass masochists, brat tamers, bratty tops, and more are invited to join a (friendly and possibly slightly antagonistic) discussion on all things brat. We’ll cover everything from defining labels to negotiating for bratting, and end with time for brats to share Bad IdeasTM with one another."
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Waterboarding",
    "location": "Dungeon Trees",
    "organizers": [
      "Madeline",
      "Alex"
    ],
    "description": "Torture really can be fun!!  Waterboarding is the torture technique that tricks the victim’s brain into believing it is drowning by using an understanding of human anatomy and as little as a cup of water. Come learn what waterboarding is and is not, some historical context, a LOT about the risks and safety of waterboarding, and have some myths busted.   This class will not just focus on how to waterboard someone, but will also cover what the experience is from the bottom's perspective.  We will demonstrate three primary techniques (rag over mouth, rag in mouth, and forcing liquid into the sinuses) with some variation on each. The first three rows may get wet, but that's unrelated to the water being thrown around!"
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Sex Magic and Intimate Energy Exchange",
    "location": "Temple Space",
    "organizers": [
      "Sunny Mayne",
      "Sunny Leigh Mayne",
      "Oximus"
    ],
    "description": "Sometimes human energy, or the energy in a shared space seems palpable. Some believe this isn’t imagined at all, and in fact, the energy can be exchanged or harnessed with intent. In this class, we'll discuss and practice techniques for intimate energy exchange and the harnessing of energy created during sex for manifestation. We’ll also discuss risk profile around the sharing of energy and allowing another person into our energetic space. This interactive and inclusive class is NOT a lecture and will not focus on any one spiritual path. Solo participation is welcome but consider attending with a partner or friend who is welcome in your energy space. Please bring a blanket/towel/yoga mat."
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "Sharps Jam ION",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T14:30:00.000-04:00",
    "endDate": "2025-08-29T16:00:00.000-04:00",
    "name": "From \"Yellow\" to \"Hell No!\": Mastering Safeword Timing",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Rope for Real Bodies",
    "location": "Pavilion",
    "organizers": [
      "Sassy",
      "Fearles",
      "Fearles Masochists"
    ],
    "description": "Rope is not “one size fits all”; our bodies are all different and our rope should be, too! In this class, explore adaptable rope with an inclusive and practical approach tailored to diverse body types and abilities. We will explore techniques that help you customize your bondage for different body shapes, sizes, and mobility levels. We’ll begin by covering key factors that influence comfort, safety, and accessibility, so you can approach your rope practice with greater awareness and adaptability to varying body types and abilities. The second half of the class is dedicated to personalized questions and collaborative labbing, where we’ll work together to troubleshoot and find solutions for your unique challenges. This is a space for rope practitioners to deepen their skills with a body-aware, flexible mindset—so we can build better bondage for every body.\n\nPrerequisites:\n- The person tying should already be comfortable with foundational tying techniques and be ready to adapt and troubleshoot their bondage for various bodies. This is not a beginner class and beginner skills will not be covered.\n\n- The person being tied should be comfortable being in rope and able to give feedback about sensation, comfort, and physical limitations. While advanced rope experience isn’t required, a baseline familiarity with being tied—and a willingness to engage in collaborative problem-solving—is essential. This class involves body-awareness, communication, and some experimentation to find what works best for you."
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Negotiating Safer Sex for New and Existing Relationships",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Taylor"
    ],
    "description": "How do we negotiate safer sex?  This class introduces participants to a conversation framework exploring the different factors that are important to consider whether you are learning about or practicing safer sex in all the varieties of relationship structures.  These questions are applicable to solo poly, poly, ENM, monogamy, swinging, and all the other glorious relationship structures.  It will empower you to think about and approach these conversations with yourself and various people in your life.  All identities, experience levels, and body types are welcome and respected."
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Death Fetish 201: The Next Level",
    "location": "Dining Hall Deck",
    "organizers": [
      "James Gordon",
      "Rebecca Doll"
    ],
    "description": "So you’re already at home with the idea that sex and death are an erotic core of our culture. You’ve watched the slasher films, you’ve come to peace with those friends who have decided your kink is most definitely not okay. You want to scale new heights. We’ll talk more about the psychology of death play, its roots in our culture, and suggest ideas for scenes…and safety to keep you breathing till your next deathplay scene. We’ll look at tools for deathplay, both mental and physical."
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Fistfest! a Jam with The Fisticule",
    "location": "Sex-O-Rama",
    "organizers": [
      "Trinket",
      "Sir Kitty"
    ],
    "description": "Whether you joined us for our class or are already a fisting enthusiast, come enjoy a skill share in a supportive space for practicing this edgy form of play. The Fisticule, a Providence-based polycule with a shared passion for fisting, will be available to troubleshoot, support and guide you - look for the folks with red bandanas. Don’t sweat it if you don’t have a fisting partner, as there will be facilitated cruising time at the beginning of the jam. Recommended to bring a towel or blanket, and your favorite lube!"
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Strap-On for the Ride: A Celebration of Strap-On Orgy Fun!",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Discipline & Devotion: How to Build a D/s Dynamic",
    "location": "Dungeon Trees",
    "organizers": [
      "Jamie Joy"
    ],
    "description": "Power exchange can be one of the most intimate and transformative paths in kink — but building a Dominant/submissive (D/s) dynamic takes more than just titles and tasks. In this workshop, we’ll explore how to co-create a power dynamic rooted in trust, intention, and healing.\nTogether, we’ll dive into all the different types of dynamics including 24/7, scene-based, caregiver/little, owner/pet, service-oriented, handler/object, and more! Get ready to explore rituals, protocols, contracts, rules, rewards, and punishments — plus the profound devotion that makes it all meaningful.\nThrough interactive exercises, we’ll navigate common challenges like long distance, polyamory, work balance, lifestyle differences, and protocols that no longer serve. Whether you're just beginning your D/s journey or looking to deepen an existing connection, this class offers practical tools and frameworks for negotiation, role development, and sustainable structure. \nCome prepared to reflect, dream, and design your unique dynamic in your own unique way!"
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Turning Sighs into Song: Creating Love Songs Without Words",
    "location": "Temple Space",
    "organizers": [
      "Redwood"
    ],
    "description": "As early humans, it’s possible that we learned to sing before we had words. In this class we’ll immerse ourselves in a long walk back to our early selves, back to so many suns and moons and so many suns and moons before that, and pretend that we don’t have words to express our love yet. Using only our sighs and the tones of \"want\", we’ll create love songs with no words..  just the sounds of our early Selves. And we’ll debrief and have a chance to share what we saw, heard, felt, smelled and learned while we were back to our early Selves. How will you turn your sighs into song?"
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Beginner Juggling",
    "location": "Pyro Playground",
    "organizers": [
      "Raven Rose"
    ],
    "description": "In this class we’ll start tackling the foundational cascade pattern with 3 balls.\nWe will also learn hand-eye coordination drills, tips to build muscle memory and how to practice effectively (and enjoy the process!)\nNo experience necessary! Just a willingness to drop the ball (a lot!) and keep trying."
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Newcomer Orientation: Welcome to Dark Odyssey! (5:15pm to 6pm)",
    "location": "Other Spaces",
    "organizers": [
      "Sejay"
    ],
    "description": "New here? Nervous about attending your first event? Come enjoy a short and entertaining introduction to play conferences and get a warm welcome to our Dark Odyssey kink-sex-spirit community. Orientations are only 45 minutes, offered multiple days and times on the schedule, and first-timers receive a free cherry pin for attending! Get the skinny on navigating this scintillating environment, play party etiquette, and how to engage with folks in our magical consent-based culture. We'll give you a layout of the luxurious grounds setup, model the amazing scene you'll see throughout the conference, guide you through interactive learning activities like Sejay's patented \"flirting or gross?\" game, and provide pro tips for maximizing your good time. Whether you’re new to the scene, curious, cautious, or excited to dive in, stop by to meet fellow newcomers, get a lay of the land, and kick off your adventure feeling confident, connected, and ready to go!"
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Kidnapping Program Meet & Greet",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T16:30:00.000-04:00",
    "endDate": "2025-08-29T18:00:00.000-04:00",
    "name": "Drumming TOGETHER!",
    "location": "Other Spaces 3",
    "organizers": [
      "Patch",
      "Patch Kyaio"
    ],
    "description": "In this workshop, we will be going over the basics of hand drumming as well as some practice techniques and really get into some interesting and fun rhythms! We will talk about different kinds of drums and their roles, as well as the basics of engaging in a drum circle and building a beat together. \nAll are welcome! Bring a drum if you have one! Some instruments will be available to use, first-come style."
  },
  {
    "startDate": "2025-08-29T18:30:00.000-04:00",
    "endDate": "2025-08-29T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T18:30:00.000-04:00",
    "endDate": "2025-08-29T20:00:00.000-04:00",
    "name": "Fire Spinning Safety Training (7pm--8pm)",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "(Takes place during the first 40 minutes of Fire Spinning Safety Training)\nALL fire related activities have a high risk profile and require a lot of attention to safety. This class will cover best practices on how to both safely spin and be a safety for others. This includes things like, the spinner to safety dynamic/communications, fuels, safety blankets, clothing and what is considered “a bad idea”. We will talk about properly fueling a prop, what a fueling station should have, why fire extinguishers are ONLY a last resort, and what to do if things go south."
  },
  {
    "startDate": "2025-08-29T18:30:00.000-04:00",
    "endDate": "2025-08-29T20:00:00.000-04:00",
    "name": "Kinky Shabbat",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T20:30:00.000-04:00",
    "endDate": "2025-08-29T22:00:00.000-04:00",
    "name": "Clue: After Dark BIPOC Mixer",
    "location": "Sex-O-Rama",
    "organizers": [
      "Buddha",
      "Boy Dana",
      "boy Dana"
    ],
    "description": "a POC-centric soirée and a celebration of bold sensuality, cultural pride, and playful intrigue. Dress to enchant, flirt with purpose, and unravel the secrets that bind you. Tonight, every heartbeat is a clue—and every encounter could be the final confession. Are you ready to discover your guilty pleasures?"
  },
  {
    "startDate": "2025-08-29T20:30:00.000-04:00",
    "endDate": "2025-08-29T22:00:00.000-04:00",
    "name": "Sensual Mysteries Ritual",
    "location": "Temple Space",
    "organizers": [
      "Thista"
    ],
    "description": "Sacredness is everywhere, and the greatest Mysteries are those moments that cannot be trapped in words. Come to the Temple to sample rites of embodied spirit, or savor the energy of sacred space in whatever acts of somatic pleasure inspire you.  Our Temple crew will have interactive experiences for you to try if you like, and the Temple will be open for all expressions of embodied sensuality."
  },
  {
    "startDate": "2025-08-29T20:30:00.000-04:00",
    "endDate": "2025-08-29T22:00:00.000-04:00",
    "name": "Fire Jam",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "The fire spinning circle will be open for anyone to come spin, watch and share in our pyro revelries. Fire safeties will be on duty. If it’s your first time lighting up or you’ve been on this journey for a hot minute, all are welcome and encouraged to join us. We do require that you attend a DO field safety meeting, just to go over how we run safety."
  },
  {
    "startDate": "2025-08-29T20:30:00.000-04:00",
    "endDate": "2025-08-29T22:00:00.000-04:00",
    "name": "A Night in MrO’s Mansion: Dungeon Play Party (9:00-11pm)",
    "location": "Other Spaces",
    "organizers": [
      "House of O \n(Mr O",
      "toy)"
    ],
    "description": "Mr O has taken over Mr Boddy’s mansion! He is putting on his detective hat and bringing along his trusty pathetic companion toy to keep an eye on all you suspicious characters! \r\nJoin us for a dungeon play party with a fun little twist! A night of themed “Rooms”, fun photo opportunities and accusations abound!\r\nHouse guests are invited to dress up in their finest garments and explore the rooms that best suit their needs while MrO and his hound keep a watchful eye…\r\nParticipants are invited to cum, investigate, and interrogate their (willing) suspects in whatever ways they see fit!\r\n\r\nWear your favourite clue outfit or act out your own devious, dirty, delicious acts… it is a murder mystery after all."
  },
  {
    "startDate": "2025-08-29T22:00:00.000-04:00",
    "endDate": "2025-08-30T00:30:00.000-04:00",
    "name": "Connection in Motion: A Fusion Dance Experience (10pm-12am)",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-29T22:00:00.000-04:00",
    "endDate": "2025-08-30T00:30:00.000-04:00",
    "name": "Clue: Sinful Secrets BIPOC Orgy",
    "location": "Sex-O-Rama",
    "organizers": [
      "Buddha",
      "Boy Dana",
      "boy Dana"
    ],
    "description": "This is more than an orgy; it’s a rite of liberation for People of Color. Here, no one plays detective; every touch is a revelation, every whisper a clue to taboo fantasy. Surrender your inhibitions and discover pleasure without limits—because tonight, the only mystery is how far you’ll go."
  },
  {
    "startDate": "2025-08-29T22:00:00.000-04:00",
    "endDate": "2025-08-30T00:30:00.000-04:00",
    "name": "Bunnies Cock & Tail Hour (11pm) (Cabin 11 & 12)",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T08:30:00.000-04:00",
    "endDate": "2025-08-30T10:00:00.000-04:00",
    "name": "Murder Mystery: Miss Scarlett (all day, camp-wide-",
    "location": "Camp-Wide",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Summer Camp is always full of intrigue, mystery, and a fair bit of foul play. This year, something's afoot at camp. Each day, our mysterious butler/entertainment director, Wadsworth, will give his welcome and introduce the day's news - typically, a murder most foul, which you intrepid campers can help solve by participating in a scavenger hunt.\n\nTest your detective skills at trivia night or attend a secret soiree in the mansion's ballroom, all the while looking for hidden clues among the scenery to find out the killer's identity, hiding place, and murder weapon. Locate the weapon cache for small prizes each day or complete the scavenger hunt all four days (Thurs-Sun) to be entered into a drawing for a grand prize at dinnertime on Sunday!\n\nHelp us hunt down the killers in our midst, and we’ll stack the bodies in the cellar, have a nice play party, leave quietly, and pretend this whole thing never happened."
  },
  {
    "startDate": "2025-08-30T08:30:00.000-04:00",
    "endDate": "2025-08-30T10:00:00.000-04:00",
    "name": "Sunrise Self-Ties (7-8:30am)",
    "location": "Pavilion",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T08:30:00.000-04:00",
    "endDate": "2025-08-30T10:00:00.000-04:00",
    "name": "Breakfast",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Spin, Pole, Spin!",
    "location": "Pavilion",
    "organizers": [
      "Sara WithoutanH"
    ],
    "description": "Learn to control your spin-on-spin pole! Class will include warm up and conditioning, then move to spins, controlling momentum, and inversions. You’ll feel like you’re flying! Please wear shorts and NO lotions or jewelry."
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Open Wide! Playing with the Mouth",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "MrsB"
    ],
    "description": "Once you’ve got your bottom all tied up and helpless, what better thing to do than explore that wet, inviting hole in their face? From rope and twine to chopsticks, floss, clothespins, food, and weights, there are so many amazing ways to use that warm, moist, intimate playground hat is the mouth."
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Building Trust",
    "location": "Dining Hall Deck",
    "organizers": [
      "Lolita Wolf"
    ],
    "description": "How do you achieve intimacy and create an awesome, even sacred bond with a partner? How is it that one person allows another to take control over them? Before such a potent understanding is forged between adults, trust needs to exist. Trust can be built up in a number of ways. Come, learn and put to use the communication skills and honorable actions that go hand in hand on the road to complete and total trust."
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Pamporium 10:00 am — 1:00 pm",
    "location": "Sex-O-Rama",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Take Down and Capture",
    "location": "Barn Class Tent",
    "organizers": [
      "Toy",
      "House of O \n(Mr O",
      "toy)"
    ],
    "description": "Being captured is a central element of many fantasies, but the logistics can be challenging. We will demonstrate some of the principles we can apply when we want to include abduction or capture scenes in our play. The focus is on how to reduce the risk of consent issues, injury, or other complications through careful negotiations and planning, then using simple and effective techniques to complete the abduction. We discuss the considerations we need to make when keeping a captive, and how to manage the stress it puts on the tops and the bottoms. (Demo Only, with lecture & discussion)"
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "WASTELAND Leading the Dance Because You Can",
    "location": "Dungeon Trees",
    "organizers": [
      "March"
    ],
    "description": "This hands-on class covers bottom-led rope experiences and why they are essential learning tools for both sides of play. We will talk about effective communication, applying body awareness to your advantage in suspension, and some “hard” skills in rope that can keep the equilibrium fun and exciting in this dance we call rope bondage. \nThis class shows a specific suspension sequence for following along, and modifications for different needs/wants are suggested."
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Spicy & Dark Pet Play",
    "location": "Temple Space",
    "organizers": [
      "Lady Plume"
    ],
    "description": "Explore the spicier and darker sides of animal roleplay where you can do things with a human critter that you would never do with a bio-animal. If you are ready to go beyond “cute and cuddly”, you can expand your animal role play into kinky fun, psychological mind games, sexy times, and hot power exchanges. This interactive class will discuss potential spicy (sexual) and dark elements that an owner/handler and human animal may choose to incorporate, including training, physical restraints (bondage or sensory deprivation), vet / medical play, breeding scenes, and other animal-related activities"
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Intermediate Dragon Staff",
    "location": "Pyro Playground",
    "organizers": [
      "Raven Rose"
    ],
    "description": "We’ll continue to improve our skills by incorporating new pathways and building connections between contact and spin based moves."
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Newcomer Orientation: Welcome to Dark Odyssey! (11:15am to 12pm)",
    "location": "Other Spaces",
    "organizers": [
      "Sejay"
    ],
    "description": "New here? Nervous about attending your first event? Come enjoy a short and entertaining introduction to play conferences and get a warm welcome to our Dark Odyssey kink-sex-spirit community. Orientations are only 45 minutes, offered multiple days and times on the schedule, and first-timers receive a free cherry pin for attending! Get the skinny on navigating this scintillating environment, play party etiquette, and how to engage with folks in our magical consent-based culture. We'll give you a layout of the luxurious grounds setup, model the amazing scene you'll see throughout the conference, guide you through interactive learning activities like Sejay's patented \"flirting or gross?\" game, and provide pro tips for maximizing your good time. Whether you’re new to the scene, curious, cautious, or excited to dive in, stop by to meet fellow newcomers, get a lay of the land, and kick off your adventure feeling confident, connected, and ready to go!"
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "Kinky Repair Cafe",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T10:30:00.000-04:00",
    "endDate": "2025-08-30T12:00:00.000-04:00",
    "name": "BYOM(elons): The Thighs Return",
    "location": "Other Spaces 3",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T12:30:00.000-04:00",
    "endDate": "2025-08-30T16:00:00.000-04:00",
    "name": "State Fair Free Lunch For Everyone! Vendors, Poolside Mai Tai CockTail Hour, Swap & Shop, Clothing & Toy Swap, Games and MORE!",
    "location": "Camp-Wide",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T12:30:00.000-04:00",
    "endDate": "2025-08-30T16:00:00.000-04:00",
    "name": "Friends of Bill/ RITL (1:00-2:00)",
    "location": "Pyro Playground",
    "organizers": [],
    "description": "Friends of Bill daily meetings will be facilitated in the style of RITL (Recovery in the Lifestyle), a fellowship based on the 12 Steps and the 12 Traditions. The meetiings are available to folks in any kind of recovery and thier supporters. You do not need to be a 12-step participant to attend and participate. All those in recovery, and their supporters, are welcome!"
  },
  {
    "startDate": "2025-08-30T12:30:00.000-04:00",
    "endDate": "2025-08-30T16:00:00.000-04:00",
    "name": "JBG Mai Tai COCKtail Hour (2pm)",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Pole Doubles",
    "location": "Pavilion",
    "organizers": [
      "Sara WithoutanH"
    ],
    "description": "Pole is more fun with a buddy! Learn ways to dance together with spins, climbs, and weight sharing skills. This class is for students with some pole/aerial experience and be able to climb/spin safely. Skills will vary with experience levels. Please wear shorts and NO lotions or jewelry."
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Beastly Desires (advanced primal)",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Sunny Mayne",
      "Sunny Leigh Mayne",
      "Oximus"
    ],
    "description": "What happens when we let our inner beasts out to play, or issue a challenge to a partner’s beast? Take a deeper dive into primal play. Join Sunny for an exploration of rough body play, struggle play, and CNC (consensual non-consent) play as part of primal exchange. We’ll also dig in to the ways this type of play reinforces primal relationship dynamics, and the ways primality can bleed into other types of D/s exchange. This class will include discussion and demonstration of advanced play and it is recommended for participants who already have very strong negotiation skills, agency, and an awareness of their personal risk profile.  CW: CNC play, hunting play, rough body play, claw knives, breath restriction."
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Use Your Words: Communication for Bottoms + Submissives",
    "location": "Dining Hall Deck",
    "organizers": [
      "Marcia B"
    ]
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Going Down to Business (Cunnilingus)",
    "location": "Sex-O-Rama",
    "organizers": [
      "Vonka"
    ],
    "description": "Are you a cunning linguist? This class is for those who want to learn to improve their tongue game as well as those who want to learn to receive a good licking. Vonka will demystify going down on innie bits/vulvas in addition to the mental and emotional elements of eating out. You’re gonna lick it."
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "When No Means Yes: Exploring Consensual Non-Consent",
    "location": "Barn Class Tent",
    "organizers": [
      "Jamie Joy"
    ],
    "description": "Consensual Non-Consent (CNC) is an exhilarating and often misunderstood facet of sex and kink. This interactive workshop delves into the psychological dynamics, ethical considerations, and practical tools that make CNC play consensual and fulfilling for everyone involved. Together, we'll discuss how to negotiate boundaries, build trust, address trauma, and maintain safety while embracing the healing power of surrender and control\n\nLearn how to explore all the diverse styles of CNC play, including physical resistance, role play scenarios like kidnapping and interrogation, orgasm control, medical fetishes, blackmail, cuckolding, bimbofication, fuck toys, service, seduction, and more. Whether you’re curious about incorporating CNC into your dynamic or looking to deepen your understanding, this workshop offers insights and guidance to approach this edge play with confidence and care. Come discover how BDSM can be used as a powerful tool for healing!"
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Intimate Body Painting for Partners",
    "location": "Dungeon Trees",
    "organizers": [
      "Lola Montez"
    ],
    "description": "It’s easy to fall into patterns with our partners and even easier to overlook the everyday beauty of the bodies we love and play with. This workshop invites you and one (or more) partners to slow down and truly see each other again. Using body paint as our medium, we’ll celebrate each other’s unique curves, marks, muscles, bruises, and features highlighting our favorite parts and exploring new ones through color, touch, and attention. Whether you're longtime lovers or new playmates, come enjoy a creative, sensual opportunity to see, be seen, and leave your mark."
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Building A Sacred Relationship With Fire",
    "location": "Temple Space",
    "organizers": [
      "Keiden Bren"
    ],
    "description": "Humans have a special relationship with fire but our Western culture has distanced us from our primal relationship with this element. Fire has historically been a place of gatherings and storytelling, and the origin stories of fire can be seen amongst the mythos of multiple cultures.  Fire is integral to many magical workings: cleansing, purification, release, transformation, and transmutation. In this class we will discuss the physical mechanics and metaphysics of building and working with a sacred intentional fire."
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Fire Spinning Safety Class (4:30-5:15pm)",
    "location": "Pyro Playground",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T16:30:00.000-04:00",
    "endDate": "2025-08-30T18:00:00.000-04:00",
    "name": "Queer Mixer (Poolside Tent)",
    "location": "Other Spaces",
    "organizers": [
      "aerabelle"
    ],
    "description": "Welcome to the Queer Social. We’re here to create a welcoming space for queer-identified folx to meet up and hang out with their fellow queers. This event is a great, low-key way to connect with others in the queer community and we hope you’ll join us. We promise, you’re queer enough!"
  },
  {
    "startDate": "2025-08-30T18:30:00.000-04:00",
    "endDate": "2025-08-30T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-30T18:30:00.000-04:00",
    "endDate": "2025-08-30T20:00:00.000-04:00",
    "name": "Now Showing: Clue The Movie (7-8:30pm)",
    "location": "Other Spaces",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Who killed who, with what, and in which fabulous room? Find out at 7:30pm Tuesday & Wednesday evenings on the Wastelands as we serve up Clue on the big screen! \r\nEnjoy the movie that inspired Summer Camp 25’s theme. Watch, be inspired & Perhaps even act out your dirtiest drive-in movie fantasies! (Weather permitting)"
  },
  {
    "startDate": "2025-08-30T20:30:00.000-04:00",
    "endDate": "2025-08-30T22:00:00.000-04:00",
    "name": "Clue: A Killer Show of Mystery & Desire - Hosted by Shay (8:30pm-10:30pm)",
    "location": "Other Spaces",
    "organizers": [
      "Shay Tiziano",
      "Hosted by Dark Odyssey"
    ],
    "description": "The mansion doors creak open… and the games begin. Join a world of seductive suspicion, where aerial sirens, burlesque beasts, and variety vixens concoct a tantalizing tale of intrigue and indulgence, inspired by the classic whodunnit Clue. Was it Miss Scarlet, wrapped in silks and secrets? Professor Plum with the rope? \n\nThis isn’t just a sit-down show – the evening includes two tight, show-stopping spotlight sets, as well as ambient acts, interactive activities, and showcase scenes that unwind the mystery, with each reveal more tempting than the last.\n\nPerhaps YOU hold the missing piece – dress to kill for our costume contest! Channel an OG character or arrive as a glamorous OC suspect of your own design, and feel free to create a dramatic “murder” for your time parading across the stage! Swap theories and socialize in style… just don’t trust anyone with the candlestick. \n\nCome curious. Leave implicated. Are you ready to play?\n\nThis event transitions into our “Murder On The Dance Floor” party!"
  },
  {
    "startDate": "2025-08-30T22:00:00.000-04:00",
    "endDate": "2025-08-31T00:30:00.000-04:00",
    "name": "Dyke4Dyke Leather Takeover — Quinn & Eevee (Starts 11pm)",
    "location": "Pavilion",
    "organizers": [
      "Quinn",
      "Eevee"
    ],
    "description": "It's Saturday night at sex camp, where would you rather be than surrounded by a pack of voracious Dykes? Join us at the lower pavilion ready to celebrate radical sex positivity in all its forms. Self-identited Dykes of all genders, presentations and sexualities are enthusiastically welcome to attend. Expect an open self-serve bar, cozy spaces to play + fuck, and a community of like minded deviants."
  },
  {
    "startDate": "2025-08-30T22:00:00.000-04:00",
    "endDate": "2025-08-31T00:30:00.000-04:00",
    "name": "Fire Jam (10:30pm)",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "The fire spinning circle will be open for anyone to come spin, watch and share in our pyro revelries. Fire safeties will be on duty. If it’s your first time lighting up or you’ve been on this journey for a hot minute, all are welcome and encouraged to join us. We do require that you attend a DO field safety meeting, just to go over how we run safety."
  },
  {
    "startDate": "2025-08-30T22:00:00.000-04:00",
    "endDate": "2025-08-31T00:30:00.000-04:00",
    "name": "Murder on the Dance Floor: A Killer Party of Mystery & Desire (10:30pm-12:30am)",
    "location": "Other Spaces",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "After our decadent performers leave their mark, the real game begins. The night’s not over—the mystery is just foreplay.\nWelcome to Murder on the Dance Floor: a high-energy Dance & Play party where the usual slutspects are out in full force. Come get kinky, sleuthy, and scandalous as you hunt for clues, chase theories, and maybe get a little tied up. \nExpect filthy fun and pulsing beats from DJs Sea and Strega, setting the scene for a night of dance, debauchery, and deviant play. Act out your suspicions, tease your truths, and show us who really dunnit.\nBring your best alibi, your dirtiest intentions, and an outfit to die for... or in."
  },
  {
    "startDate": "2025-08-30T22:00:00.000-04:00",
    "endDate": "2025-08-31T00:30:00.000-04:00",
    "name": "Trance Dance (Lower Fire Pit)",
    "location": "Other Spaces 3",
    "organizers": [
      "Patch Kyaio"
    ],
    "description": "Come on a journey with us. A journey simultaneously inward and out as we generate a space together in which we can let go and drop in. Trance is more than a word. It's a journey. Across cultures and centuries, humans have entered trance to commune with nature, spirit, and self. To heal, to see, to remember. We carry that legacy forward. Through rhythm, movement, chant, and breath, we invite you to sink into a state shaped by repetition and meditative shifts in awareness. Together, we’ll rediscover each other, the rhythm of life, and the living world around us, just as our ancestors once did. All this in exploration, in elation, and in celebration of US! (No Late Admittance, Participation Required.)"
  },
  {
    "startDate": "2025-08-31T08:30:00.000-04:00",
    "endDate": "2025-08-31T10:00:00.000-04:00",
    "name": "Murder Mystery: Mr. Green (all day, camp-wide-",
    "location": "Camp-Wide",
    "organizers": [
      "Hosted by Dark Odyssey"
    ],
    "description": "Summer Camp is always full of intrigue, mystery, and a fair bit of foul play. This year, something's afoot at camp. Each day, our mysterious butler/entertainment director, Wadsworth, will give his welcome and introduce the day's news - typically, a murder most foul, which you intrepid campers can help solve by participating in a scavenger hunt.\n\nTest your detective skills at trivia night or attend a secret soiree in the mansion's ballroom, all the while looking for hidden clues among the scenery to find out the killer's identity, hiding place, and murder weapon. Locate the weapon cache for small prizes each day or complete the scavenger hunt all four days (Thurs-Sun) to be entered into a drawing for a grand prize at dinnertime on Sunday!\n\nHelp us hunt down the killers in our midst, and we’ll stack the bodies in the cellar, have a nice play party, leave quietly, and pretend this whole thing never happened."
  },
  {
    "startDate": "2025-08-31T08:30:00.000-04:00",
    "endDate": "2025-08-31T10:00:00.000-04:00",
    "name": "Breakfast",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Lap Dances for Lay People",
    "location": "Pavilion",
    "organizers": [
      "Sunny Mayne",
      "Sunny Leigh Mayne",
      "Oximus"
    ],
    "description": "Come explore sensual movement for sexy times with a partner or partners! We’ll cover easy ways make movement sensual, movement as foreplay (or the main event), and even ways that sexy lap dancing or sensual movement can convey and reinforce dynamic! This class is designed to be accessible for all levels of mobility. Zero experience required. Attend with or without a partner and participate to your own comfort level in this sexy and interactive class! Don’t want to dance, that’s Ok! Dance along, receive a dance from a companion, or just come and enjoy she show!"
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Kinky Truth or Dare for Adults",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Marcia B"
    ],
    "description": "Do you dare to play this elevated take on Truth or Dare? After a quick discussion on crafting the best truths and dares, we'll co-create a game that blends the saucy, spicy, tender, and tantalizing. Each card drawn invites you to reveal hidden truths or embrace dares that push playful boundaries. More than just a game, this is a chance to connect, build trust, and create unforgettable, laughter-filled memories."
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Little's Craft Corner",
    "location": "Dining Hall Deck",
    "organizers": [
      "Lola Montez"
    ],
    "description": "Tap into the child-like freedom and creativity that still lives inside us by creating art, making crafts, and being a little silly led by Ms. Montez. Providing a classic camp pastime with some kinky twists! So bring your stuffies, your journals, your creativity and get ready to make some memories you can take home with you. Bring an article of clothing to tye-dye, make friendship bracelets with your metamour, Paint a card for your crush, and more!"
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Confident Submission: Owning Your Power Before the Exchange",
    "location": "Sex-O-Rama",
    "organizers": [
      "MrsB"
    ],
    "description": "Being the little letter in a power exchange takes a lot of strength and audacity. In this guided discussion we will try to identify, nurture, and be mindful of the powerful qualities a strong bottom brings to the table."
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Get a Clue: Responding to Bias",
    "location": "Barn Class Tent",
    "organizers": [
      "Temptress Ari"
    ],
    "description": "The current climate has emboldened all kinds of bad behavior in both vanilla and kink spaces. Biased language, jokes in poor taste, microaggressions, and other isms abound. It can feel hard and scary to know how to respond when these things happen. This workshop covers ways to respond to bad behavior, including calling in vs calling out vs calling on, using humor, finding your authentic voice, offering education and care, and how to respond if you are confronted about your own behavior."
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "WASTELAND Adaptable Lower Body Ties",
    "location": "Dungeon Trees",
    "organizers": [
      "Sassy",
      "Fearles",
      "Fearles Masochists"
    ],
    "description": "This hands-on class is designed for those who want to deepen their understanding of suspension-ready lower body harnesses. Together, we’ll explore suspendable variations of a mermaid tie, thigh binder, and calf binder. Students will be guided step-by-step through the ties, learning about their structural elements, how to modify for different bodies, and key safety considerations. Time permitting, we will also show how these harnesses can be loaded in suspension. By the end of the class, you’ll not only have learned versatile and adaptable suspension harnesses, but also gained tools for customizing and adapting other ties to suit your unique needs."
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Trans Lifeline",
    "location": "Temple Space",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Intro to Contact Staff",
    "location": "Pyro Playground",
    "organizers": [
      "Chad"
    ],
    "description": "This class covers spinning without using your thumbs. Sounds like magic but you ARE a magician (you may not know it yet). We will have tons of fun, learn some moves, and be silly for a bit. No experience needed. Practice staves will be provided."
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "Fused Glass",
    "location": "Other Spaces",
    "organizers": [
      "Tasty Tina"
    ],
    "description": "Come and make your own fused glass jewelry, amulet, or altar piece with colorful dichroic and art glass! Add precious metals and murrini. The materials fee is $30.00 per piece. (Please note: you must return later in the day, or the next day, to pick up your fired & completed piece.)"
  },
  {
    "startDate": "2025-08-31T10:30:00.000-04:00",
    "endDate": "2025-08-31T12:00:00.000-04:00",
    "name": "The DI Experience",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T12:30:00.000-04:00",
    "endDate": "2025-08-31T14:00:00.000-04:00",
    "name": "Lunch",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T12:30:00.000-04:00",
    "endDate": "2025-08-31T14:00:00.000-04:00",
    "name": "(closed for set-up)",
    "location": "Temple Space",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T12:30:00.000-04:00",
    "endDate": "2025-08-31T14:00:00.000-04:00",
    "name": "Friends of Bill/ RITL (1:00-2:00)",
    "location": "Other Spaces",
    "organizers": [],
    "description": "Friends of Bill daily meetings will be facilitated in the style of RITL (Recovery in the Lifestyle), a fellowship based on the 12 Steps and the 12 Traditions. The meetiings are available to folks in any kind of recovery and thier supporters. You do not need to be a 12-step participant to attend and participate. All those in recovery, and their supporters, are welcome!"
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Floorwerk and Flow",
    "location": "Pavilion",
    "organizers": [
      "Sara WithoutanH",
      "Vonka"
    ],
    "description": "Let's get sexy and sassy! Learn a variety of sexy floorwork skills and techniques. Class will cover body rolls, fankicks, leg clockwork, shoulder rolls and more. Class will include a warm up, review of skills, and then a choreographed floorwerk flow. Heels optional, students encouraged to wear something that covers the knees/feet and to bring a mat."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Kinetic Bondage: Contact Improvisation in Floor Rope",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "March"
    ],
    "description": "In this dynamic, hands-on class, we blend the principles of contact improvisation(a postmodern dance form) with rope, creating a collaborative movement lab focused on connection, responsiveness, and flow. \nPeople tying will learn to convey tempo, velocity, levels, and weight with rope and touch. People being tied will learn to place their emotions and affect into modalities of nonverbal communication to optimize connection. We'll investigate how power, vulnerability, and mutual curiosity can be communicated not just through fibers, but through shared weight, movement, and touch.\nThe class begins with solo and partnered movement exercises (without rope) to awaken somatic awareness and establish physical trust. Then we’ll transition to using rope as a medium, emphasizing responsiveness over choreography, and feeling over form. \nWhether you're tying or being tied, you’ll gain tools for reading and shaping a scene with greater emotional clarity, physical nuance, and collaborative intention. \n\nRequirements:\n- People tying must know how to tie a non-cinching single column tie with ease and speed.\n\n- People being tied should know basic nerve safety and be comfortable with verbal communication.\n\n- All participants should have some experience with floor rope and be open to movement-based exploration. Participants will be instructed to walk, stand, and sit on the ground - modifications are welcome and appreciated."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Long Distance Polyamory",
    "location": "Dining Hall Deck",
    "organizers": [
      "HG Wyndell"
    ],
    "description": "Whether partners are 2 hours away or halfway around the world, it can take a lot more than Google Calendar to make long-distance polyamorous relationships functional, healthy, and fulfilling. Sometimes the distance is a six-month job placement, sometimes it’s living thousands of miles apart. Distance will multiply the complexity already present in polyamorous relationships. We’ll discuss the challenges, additional dynamics, and helpful approaches to long-distance polyamory based on lived experience. Hopefully leaving you with more tools in your toolbox for figuring out how to make it work in healthy and fulfilling ways for you."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Overly Attached: Advanced Medical Play",
    "location": "Sex-O-Rama",
    "organizers": [
      "Toy",
      "House of O \n(Mr O",
      "toy)"
    ],
    "description": "Tired of learning rope ties and using cuffs to keep people where you want them? Have squirmy bottoms that try to get away? We'll look at ways to use needles, piercings, fish hooks and staples to attach people to themselves, other people, or objects. We will discuss safety precautions as well as the techniques, equipment and supplies to use. A demonstration of medical bondage will be performed."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "If You Like It, Put A Ring On It: Cock and Ball Accessorizing",
    "location": "Barn Class Tent",
    "organizers": [
      "Shay Tiziano",
      "lemec"
    ],
    "description": "This highly interactive class will look at sexy, intense, silly, and entertaining ways to “decorate” the cocks in your life. The instructors will start with a basic discussion of anatomy, safety considerations, negotiation, and circumcised vs. intact vs. strap-on cocks, then move into formal accessories like cock rings and chastity devices. They will then demonstrate multiple cock and ball bondage techniques, including using bondage to create a cock ring, wrapping everything up in a neat (and easy!) package, making a cock “helicopter,” creating a kynodesme (google it!), and cock bondage for chastity. Class participants are encouraged to practice along and get creative! The instructors will provide cord for in-class use. They may be able to facilitate people pairing up (or you can practice on yourself), but you’re encouraged to come to this session with an enthusiastically consenting “stunt cock” of your own."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Single Tails: The Epitome of SM",
    "location": "Dungeon Trees",
    "organizers": [
      "Lolita Wolf"
    ],
    "description": "This sexy activity can range from delicate to cruel. Lolita will speak about using a whip for play, different types of whips, the physics of whip motion, buying a whip and the cleaning and caring of your whip. A demo will cover the dynamics of a whip scene from negotiation through aftercare. Please bring a whip for some hands on practice."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Ritual Hook Pull",
    "location": "Temple Space",
    "organizers": [
      "Thista"
    ],
    "description": "Celebrate your connections to the world around you in a ritual hook pull. Set intention with your community as we create sacred space for our journey together. Then, feeling the weight of hooks in flesh, dance through the ways we relate to one another. Pull for your individual relationships, for your community, for the land we’re on, for the divine spark of the universe, or for any other connection that inspires your soul. When your dance is done, come full circle with your peers to reflect on the journey we shared, and take home a memento of your experience."
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Strip Sword Fighting Practice",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T14:30:00.000-04:00",
    "endDate": "2025-08-31T16:00:00.000-04:00",
    "name": "Leather Care Social",
    "location": "Other Spaces 2",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "CampLift Goodbye Party Fashion Show and Dance Party Sendoff!",
    "location": "Pavilion",
    "organizers": [
      "Redwood"
    ],
    "description": "People often talk about CampDrop, but wouldn’t it be a lovely idea to think of it in terms of CampLift? Not to bypass the beautifully hard emotions that sometimes show up at the end of Camp and after - but to also encourage a sense of the tidal emotional Lift that we can ride to the depths of our life, outside of Camp.\nWouldn’t it be so fun to have a dance party where we Lift each other up, and it sends us off to the outside world full of love, encouragement and bliss? Campers often mention that they didn't get a chance to wear all of the amazing outfits they brought, so we'll also have a brief fashion show before the dance party for folks to show off any clothes they didn’t get to wear during Camp. You don’t have to be any good a CatWalking to be in the show, just have a desire to show off what you didn’t get a chance to wear, or to give that outfit you wore and loved, a TakeTwo!"
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Cigar Play",
    "location": "Dungeon (Class Tent)",
    "organizers": [
      "Ryan",
      "Rebecca Doll"
    ],
    "description": "Cigar play is a style of play steeped in transgression and mystique. Ryan and Rebecca Doll will guide you through the techniques and tools of cigars, the versatile potential of cigar scenes, and practical approaches to cigar service. Cigars will be provided for all to enjoy!"
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Trans/ Enby Social Hour",
    "location": "Dining Hall Deck",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Getting the Most out of Group Sex",
    "location": "Sex-O-Rama",
    "organizers": [
      "Vonka"
    ],
    "description": "Group sex provides unique opportunities for pleasure, but more people can also mean more problems. Whether you’ve got 3 partners or 30, proper planning and good communication are key to maximizing hedonism and minimizing headaches for everyone involved. In this class, Vonka will share the tips and tricks they’ve picked up a participant and host of threesomes, foursomes, orgies, and gangbangs. You’ll leave this workshop knowing how to find partners, how to get them all on the same page, and how to translate your group sex fantasy into hot and heavy reality!"
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Sacra Voluptas ex Sancto Dolore: Playing with Corporal Mortification",
    "location": "Barn Class Tent",
    "organizers": [
      "Alixzander"
    ],
    "description": "If you are interested in the intersection of pain, spirituality, and playing with sacrament, this is the class for you! For centuries, the Opus Dei sect of the Catholic Church has followed a tenant of corporal mortification; They use pain and discomfort as a way to find spiritual insight. As a result, this sect has developed many tools and practices that shoehorn nicely into BDSM play. This class explores the history of Corporal Mortification across multiple faiths and cultures, discusses how one can use pain and ordeal as both adrenaline pumping activities as well as meditative practices, and will demonstrate several of the tools used for corporal mortification and how they can be used in scenes."
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "WASTELAND Pallet Wrap Suspension",
    "location": "Dungeon Trees",
    "organizers": [
      "Madeline",
      "Alex"
    ],
    "description": "Pallet wrap is great for keeping the drawers from falling out of your furniture as you are moving, for keeping dozens of cases of potato chips on a pallet when they are loaded onto a truck, and for suspending a bottom with absolutely no rope whatsoever. We make sure that attendees understand that we are not using saran wrap, but instead an industry supply with a high tensile strength. This technique is ideal for just about anyone, including people for whom traditional rope suspensions might be difficult or uncomfortable (due to weight, odd centers of gravity, and even some circulation issues)"
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Fuck Around and Flow Out",
    "location": "Pyro Playground",
    "organizers": [
      "Sparx"
    ],
    "description": "Are you tired of doing the same old poi moves that you already know? Are you getting bored of just spinning your staff in a circle? Join Sparx to learn how to take your flow to the next level. Come with your own props, or borrow some of ours (both LED and fire prop welcome!). Let's talk about how to engage your audience, and what you can do to add artistry and excitement to your performance. All skill levels encouraged to attend."
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Strip Sword Fighting Tournament",
    "location": "Other Spaces",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T16:30:00.000-04:00",
    "endDate": "2025-08-31T18:00:00.000-04:00",
    "name": "Drum, Dance, Trance",
    "location": "Other Spaces 3",
    "organizers": [
      "Patch",
      "Patch Kyaio"
    ],
    "description": "What is trance? How do we tap into something like that? In this intro class we will be exploring the idea of trance and how to engage in trance work and enter a state of abstraction that humans have been exploring for thousands of years. Through drum and/or dance we will discuss techniques and exercises that can help aid in this exploration and inducing these states. There will be an opportunity for us to separate to discuss the intricacies of either drum or dance, and then we will come back together to discuss and explore the combination of the two.\nBring a drum if you have one, and don't forget your water bottle!"
  },
  {
    "startDate": "2025-08-31T18:30:00.000-04:00",
    "endDate": "2025-08-31T20:00:00.000-04:00",
    "name": "Dinner",
    "location": "Barn Class Tent",
    "organizers": []
  },
  {
    "startDate": "2025-08-31T18:30:00.000-04:00",
    "endDate": "2025-08-31T20:00:00.000-04:00",
    "name": "Fire Spinning Safety Training (7pm--8pm)",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "(Takes place during the first 40 minutes of Fire Spinning Safety Training)\nALL fire related activities have a high risk profile and require a lot of attention to safety. This class will cover best practices on how to both safely spin and be a safety for others. This includes things like, the spinner to safety dynamic/communications, fuels, safety blankets, clothing and what is considered “a bad idea”. We will talk about properly fueling a prop, what a fueling station should have, why fire extinguishers are ONLY a last resort, and what to do if things go south."
  },
  {
    "startDate": "2025-08-31T20:30:00.000-04:00",
    "endDate": "2025-08-31T22:00:00.000-04:00",
    "name": "Queer Cruise & Orgy (8:30-10:30pm)",
    "location": "Sex-O-Rama",
    "organizers": [
      "aerabelle"
    ],
    "description": "Ever wanted to participate in an all-queer orgy? \nIf so, come for a fucking good time! We’ll warm up with some queer cruising then, once you’ve found your dates, we’ll get down to getting down. Bring yourself, your toys and your best consent practices to this inclusive orgy, where all queers are welcome, wanted, and just the right kind of sexy."
  },
  {
    "startDate": "2025-08-31T20:30:00.000-04:00",
    "endDate": "2025-08-31T22:00:00.000-04:00",
    "name": "Fire Jam",
    "location": "Pyro Playground",
    "organizers": [
      "Pyro Playground"
    ],
    "description": "The fire spinning circle will be open for anyone to come spin, watch and share in our pyro revelries. Fire safeties will be on duty. If it’s your first time lighting up or you’ve been on this journey for a hot minute, all are welcome and encouraged to join us. We do require that you attend a DO field safety meeting, just to go over how we run safety."
  },
  {
    "startDate": "2025-08-31T20:30:00.000-04:00",
    "endDate": "2025-08-31T22:00:00.000-04:00",
    "name": "Big-Badda-BOOM: Fire Bubbles Intensive — CoarseGrit (starts at 9pm)",
    "location": "Other Spaces 2",
    "organizers": [
      "CoarseGrit"
    ],
    "description": "Are you an experienced FirePlayer? Are you interested in big balls… of fire? In this class we will discuss the safety, equipment & techniques of Fire Bubbles. This class will include audience-hands on demonstrations and class discussions."
  },
  {
    "startDate": "2025-08-31T22:00:00.000-04:00",
    "endDate": "2025-09-01T00:30:00.000-04:00",
    "name": "Cigars & Leather Lounge",
    "location": "Pavilion",
    "organizers": [
      "James Gordon",
      "Rebecca Doll",
      "Hosted by Dark Odyssey"
    ],
    "description": "Did Mr. Boddy meet his end in the Lounge with a Cigar! Or perhaps in the Study with the Leather Boot!? Whoever did the crime, you won't be Clueless for long at our Cigar and Leather Lounge. What better way to end your Camp experience than a night of intimate fun with friends in the classy surroundings of our 100% murder free Lounge. Fans will be running, and we'll have bootblacks to take care of your needs, so take the Secret Passage to the Dark Odyssey Cigar and Leather Lounge!"
  },
  {
    "startDate": "2025-09-01T10:00:00.000-04:00",
    "endDate": "2025-09-01T12:00:00.000-04:00",
    "name": "Wadsworth's Farewell Scavenger Hunt Closing",
    "location": "Camp-Wide",
    "organizers": []
  },
  {
    "startDate": "2025-09-01T10:00:00.000-04:00",
    "endDate": "2025-09-01T12:00:00.000-04:00",
    "name": "Brunch (10am",
    "location": "Behind Barn Class Tent",
    "organizers": [
      "Noon)"
    ]
  }
]